[
  {
    "title": "Suitability & Appropriateness Assessments (MiFID II)",
    "text": "Suitability and appropriateness assessments under MiFID II ensure financial products and services match client needs, knowledge, experience, and risk tolerance. Suitability assessment applies when providing investment advice or portfolio management, requiring firms to obtain information on client's knowledge and experience in relevant investment types, financial situation including income, assets, liabilities, and regular financial commitments, and investment objectives including time horizon, risk tolerance, and purpose of investment. Assessment determines whether product or service is suitable considering client profile, with unsuitable recommendations prohibited. Appropriateness assessment applies when providing non-advised services such as execution-only, requiring assessment of client knowledge and experience to determine if client understands risks, with warning required if product appears inappropriate but client may proceed. Information collection includes questionnaires and interviews, verification of information provided, periodic updates particularly for ongoing relationships, and documentation of assessments and recommendations. Requirements include policies and procedures for conducting assessments, training of staff on assessment requirements, suitability reports explaining recommendations and how they meet client needs, appropriateness warnings when products appear inappropriate, and monitoring of assessment quality. Exemptions include appropriateness assessment not required for non-complex products such as shares admitted to regulated markets, money market instruments, and certain UCITS funds when provided execution-only without advice. Supervisory focus includes quality of assessments, adequacy of information collection, appropriateness of recommendations, and handling of negative assessments."
  },
  {
    "title": "Product Governance & Oversight",
    "text": "Product governance ensures financial products are designed, distributed, and monitored to meet needs of identified target markets and deliver fair customer outcomes. Product design phase includes identification of target market based on client characteristics, needs, and objectives, assessment of product features, risks, costs, and complexity, stress testing of product performance under adverse scenarios, and approval by product governance committee. Distribution strategy includes identification of appropriate distribution channels, assessment of distributor capabilities and target markets, provision of product information to distributors, and monitoring of distribution activities. Target market definition specifies positive target market of clients for whom product is compatible and negative target market of clients for whom product is not appropriate, considering factors such as knowledge and experience, financial situation, risk tolerance, objectives, and needs. Product monitoring includes regular review of product performance, customer outcomes, complaints, and market developments, assessment of whether product remains consistent with target market, and product modifications or withdrawal if issues identified. Requirements include documented product governance policies and procedures, product approval process with appropriate oversight, target market identification and documentation, distribution agreements specifying responsibilities, regular product reviews at least annually or more frequently for complex or risky products, and management information on product performance and customer outcomes. Supervisory expectations include robust product governance frameworks, clear accountability, adequate resources and expertise, and demonstration of good customer outcomes."
  },
  {
    "title": "Disclosure & Transparency Requirements",
    "text": "Disclosure and transparency requirements ensure clients receive clear, accurate, and timely information on products, services, costs, and risks enabling informed decisions. Pre-contractual disclosures include key information documents (KID) for packaged retail investment and insurance products (PRIIPs) providing standardized information on product features, risks, costs, and performance scenarios, terms and conditions of products and services, information on firm and its services, conflicts of interest and how managed, and costs and charges including all fees, commissions, and third-party payments. Ongoing disclosures include periodic statements showing portfolio composition, performance, and costs, transaction confirmations, information on material changes to products or services, and annual cost and charges disclosure. Cost disclosure includes all costs and charges expressed in monetary terms and as percentage, breakdown of product costs, service costs, and third-party payments, illustration of cumulative effect of costs on returns, and disclosure of inducements received from third parties. Risk disclosure includes description of risks associated with products and services, risk indicators such as summary risk indicator in KID, warnings for high-risk or complex products, and information on investor protection schemes. Requirements include clear, fair, and not misleading communications, prominent disclosure of material information, plain language avoiding jargon, timely provision of information before client commitment, and accessibility of information. Supervisory focus includes adequacy and clarity of disclosures, prominence of risk warnings, completeness of cost disclosure, and whether disclosures enable informed decisions."
  },
  {
    "title": "Treating Customers Fairly & Vulnerable Customers",
    "text": "Treating customers fairly (TCF) principle requires firms to place fair treatment of customers at center of business culture and decision-making. Six TCF outcomes include fair treatment embedded in corporate culture, products and services designed to meet needs of identified customer groups, clear information provided before, during, and after sale, advice suitable for customer circumstances, products performing as expected, and no unreasonable barriers to switching, complaining, or claiming. Vulnerable customers include those with characteristics such as low financial literacy, physical or mental health conditions, life events like bereavement or job loss, or resilience factors like low income or over-indebtedness, requiring additional care and support. Requirements for vulnerable customers include identification of vulnerability through customer interactions and data analysis, staff training on recognizing and supporting vulnerable customers, flexible and accessible communication methods, additional time and support for decision-making, proactive monitoring for signs of difficulty, and tailored solutions such as payment arrangements or product modifications. Specific protections include restrictions on aggressive sales tactics, cooling-off periods allowing cancellation, forbearance measures for customers in financial difficulty, and safeguards for customers lacking mental capacity. Requirements include TCF policies and frameworks, management information on customer outcomes, monitoring of vulnerable customer treatment, staff training and competence, and regular assessment of fairness of products, services, and processes. Supervisory approach includes thematic reviews of TCF, mystery shopping, analysis of complaints and customer outcomes, and enforcement action for poor treatment."
  },
  {
    "title": "Complaint Handling & Redress",
    "text": "Complaint handling procedures ensure customer complaints are resolved fairly, promptly, and consistently, with appropriate redress for valid complaints. Complaint definition includes any expression of dissatisfaction about products, services, or complaint handling, whether oral or written, with broad interpretation to capture all grievances. Complaint handling process includes acknowledgment of complaint promptly, investigation of facts and circumstances, assessment of whether complaint is justified, communication of decision with clear explanation, and provision of redress if complaint upheld. Redress may include financial compensation for losses or distress, correction of errors, apology, or other appropriate remedy. Timeframes include acknowledgment within specified period (typically 5 business days), resolution within maximum period (typically 15-35 business days depending on jurisdiction), and information on escalation to ombudsman or alternative dispute resolution if customer dissatisfied. Requirements include documented complaint handling procedures, accessible complaint channels, free complaint handling for customers, fair and consistent assessment, root cause analysis identifying systemic issues, management information on complaints including volumes, types, outcomes, and trends, and reporting to senior management and board. Alternative dispute resolution includes referral rights to financial ombudsman services or similar schemes providing independent review, with firms required to cooperate and comply with decisions. Supervisory focus includes complaint handling quality and timeliness, fairness of outcomes, identification and remediation of systemic issues, and use of complaints data for improving products and processes."
  },
  {
    "title": "Inducements & Conflicts of Interest",
    "text": "Inducements and conflicts of interest rules prevent or manage situations where firm or staff interests conflict with client interests, ensuring clients receive unbiased advice and fair treatment. Conflicts of interest include situations where firm or staff have financial or other interests that may influence recommendations or decisions, such as commissions from product providers, proprietary products, related party transactions, or personal trading. Requirements include identification of conflicts through conflicts register and assessment processes, disclosure of conflicts to clients in clear and prominent manner, management of conflicts through organizational and administrative arrangements such as information barriers, segregation of functions, and supervision, and avoidance of conflicts where management insufficient to ensure fair treatment. Inducements include fees, commissions, or non-monetary benefits received from third parties in relation to services provided to clients, with restrictions under MiFID II including prohibition on inducements for independent advice and portfolio management, and requirement that inducements for non-independent advice enhance quality of service and are disclosed. Permitted inducements include minor non-monetary benefits such as market information or research below threshold, and inducements that enhance service quality such as training or technology. Requirements include inducements policy defining acceptable and prohibited inducements, disclosure of inducements to clients including amounts or calculation methodology, assessment of quality enhancement for permitted inducements, and monitoring of inducements received and paid. Supervisory focus includes adequacy of conflicts identification and management, quality and prominence of disclosures, compliance with inducements restrictions, and whether conflicts or inducements lead to customer detriment."
  },
  {
    "title": "Best Execution Obligations",
    "text": "Best execution requires firms to take all sufficient steps to obtain best possible result for clients when executing orders, considering price, costs, speed, likelihood of execution and settlement, size, nature, and other relevant factors. Execution factors include price as typically most important factor, costs including commissions and fees, speed of execution, likelihood of execution and settlement, size and nature of order, and any other relevant considerations. Relative importance of factors depends on client characteristics (retail or professional), order characteristics, product characteristics, and execution venues. Execution venues include regulated markets, multilateral trading facilities (MTF), organized trading facilities (OTF), systematic internalizers, market makers, and other liquidity providers. Execution policy includes description of execution venues used, factors affecting venue selection, how factors are weighted, and how policy ensures best execution. Requirements include establishment and implementation of execution policy, annual review and update of policy, monitoring of execution quality, use of data and market information to assess venues, and notification of material changes to execution arrangements. Client consent required for executing outside regulated markets or MTF, with disclosure of execution policy and summary of execution quality. Order handling includes prompt and fair execution, prohibition on front-running or misuse of client order information, and aggregation of orders only when unlikely to disadvantage clients. Supervisory focus includes adequacy of execution policies, monitoring of execution quality, use of execution venues, and whether firms achieve best execution in practice."
  },
  {
    "title": "Market Abuse & Manipulation Prevention",
    "text": "Market abuse prevention includes detection and prevention of insider dealing, unlawful disclosure of inside information, and market manipulation, maintaining market integrity and investor confidence. Insider dealing involves using inside information (precise, non-public, price-sensitive information) to trade or recommend trading in financial instruments, with prohibition on trading, disclosure, and recommending based on inside information. Market manipulation includes transactions or orders giving false or misleading signals about supply, demand, or price, transactions or orders securing price at abnormal or artificial level, dissemination of false or misleading information, and other conduct likely to manipulate market. Detection mechanisms include transaction monitoring systems identifying suspicious patterns such as unusual trading volumes, price movements, or timing, surveillance of communications including phone calls and electronic messages, monitoring of order book activity, and analysis of trading behavior. Suspicious transaction and order reports (STORs) required when firms have reasonable suspicion of market abuse, with reporting to competent authorities. Requirements include policies and procedures for preventing market abuse, systems and controls for detection, insider lists identifying persons with access to inside information, restrictions on personal account dealing by staff, training on market abuse regulations, and cooperation with authorities in investigations. Market soundings regime allows communication of inside information to potential investors before announcements to gauge interest, with specific procedures and record-keeping. Supervisory approach includes transaction surveillance, investigation of suspicious activity, enforcement action including fines and criminal prosecution, and cooperation between authorities across jurisdictions."
  },
  {
    "title": "Responsible Lending & Affordability",
    "text": "Responsible lending principles ensure credit is provided only to borrowers who can afford repayments without financial distress, preventing over-indebtedness and consumer harm. Affordability assessment includes evaluation of borrower income from employment, benefits, or other sources, committed expenditure including existing credit obligations, housing costs, and essential living expenses, and discretionary expenditure on non-essential items, with assessment of whether borrower can afford new credit without undue hardship. Assessment methodology includes income verification through payslips, bank statements, or tax returns, expenditure assessment using declared expenditure, bank transaction analysis, or statistical models, stress testing of affordability under adverse scenarios such as interest rate increases or income reduction, and consideration of borrower's credit history and existing indebtedness. Requirements include documented affordability assessment for all credit applications, proportionate assessment with more detailed assessment for larger or longer-term credit, declining applications where credit appears unaffordable, and monitoring of affordability during credit relationship. Responsible lending practices include clear and balanced marketing avoiding encouragement of excessive borrowing, appropriate credit limits based on affordability, forbearance and support for customers in financial difficulty, and avoiding aggressive collection practices. Specific requirements for high-cost credit include affordability warnings, creditworthiness assessments, and caps on costs and charges. Requirements include responsible lending policies and procedures, staff training on affordability assessment, monitoring of lending decisions and outcomes, and assessment of whether lending is responsible and sustainable. Supervisory focus includes quality of affordability assessments, lending to customers in financial difficulty, outcomes including arrears and defaults, and fair treatment of borrowers."
  },
  {
    "title": "Early Arrears Management & Forbearance",
    "text": "Early arrears management and forbearance ensure customers in financial difficulty receive appropriate support and fair treatment, preventing escalation to serious arrears or default. Early arrears management includes proactive contact with customers at first sign of difficulty, assessment of customer circumstances and reasons for difficulty, discussion of options for resolving arrears, and agreement on sustainable solution. Forbearance measures include temporary payment arrangements such as payment holidays, reduced payments, or interest-only periods, permanent modifications such as term extensions, interest rate reductions, or principal forgiveness, refinancing or consolidation of debts, and other concessions appropriate to customer circumstances. Assessment of forbearance includes evaluation of customer's financial situation and ability to resume payments, assessment of whether forbearance is appropriate and sustainable, consideration of customer's engagement and willingness to resolve situation, and documentation of forbearance decision and terms. Requirements include forbearance policies and procedures, training of staff on forbearance options and assessment, fair and consistent treatment of customers in difficulty, monitoring of forbearance arrangements and customer compliance, and reporting on forbearance volumes and outcomes. Customer communications include clear information on forbearance options, implications of forbearance including impact on credit file, and ongoing support and contact. Prohibition on unfair practices includes restrictions on aggressive collection tactics, requirements for reasonable efforts to contact customers before enforcement action, and safeguards for vulnerable customers. Supervisory expectations include early identification and support for customers in difficulty, appropriate and sustainable forbearance, fair treatment throughout arrears process, and use of enforcement action only as last resort after exhausting forbearance options."
  }
]
