[
  {
    "title": "Credit Assessment & Underwriting Standards",
    "text": "Credit assessment and underwriting standards govern the evaluation of borrower creditworthiness before granting credit, including know-your-customer (KYC) requirements, financial statement analysis, cash flow assessment, debt service coverage ratios, loan-to-value (LTV) ratio limits, debt-to-income (DTI) ratio thresholds for consumer lending, credit scoring models and rating systems, assessment of repayment capacity and ability to pay, collateral valuation methodologies, documentation requirements for loan origination, underwriting criteria and approval authorities, credit application processing, assessment of borrower's business model and industry risks, guarantor assessment, and responsible lending obligations ensuring borrowers are not granted unaffordable credit. This includes mortgage underwriting standards, consumer credit assessment under Consumer Credit Directive, and commercial lending due diligence."
  },
  {
    "title": "Credit Risk Mitigation Techniques",
    "text": "Credit risk mitigation (CRM) techniques reduce credit exposure through funded protection such as cash collateral, financial collateral including bonds and equities, real estate mortgages, netting agreements, and unfunded protection including guarantees, credit derivatives, credit default swaps, and credit insurance. Regulatory requirements cover eligibility criteria for recognized CRM, legal certainty and enforceability of security interests, collateral valuation and revaluation frequency, haircuts applied to collateral values, margin requirements and variation margin, credit quality of protection providers, operational requirements for on-balance sheet netting, master netting agreements under ISDA frameworks, substitution and concentration limits for collateral, wrong-way risk where collateral value correlates with obligor default, documentation standards, and regulatory capital relief calculations for recognized CRM techniques under the Capital Requirements Regulation (CRR)."
  },
  {
    "title": "Expected Credit Losses, Impairment & Provisioning",
    "text": "Expected credit loss (ECL) framework under IFRS 9 requires institutions to recognize credit losses based on forward-looking information, including 12-month ECL for performing exposures in Stage 1, lifetime ECL for underperforming exposures with significant increase in credit risk in Stage 2, and lifetime ECL for credit-impaired assets in Stage 3. This encompasses staging criteria and transfers between stages, indicators of significant increase in credit risk (SICR) including quantitative thresholds and qualitative factors, incorporation of forward-looking macroeconomic scenarios and probability weighting, calculation of probability of default (PD), loss given default (LGD), and exposure at default (EAD) parameters, discounting of expected cash flows, treatment of modifications and restructuring, collective versus individual assessment, write-off policies, provisioning adequacy assessment by supervisors, Pillar 2 guidance on provisions, prudential filters and regulatory adjustments, and disclosure requirements on credit quality and allowance movements."
  },
  {
    "title": "Non-Performing Exposures & Forbearance",
    "text": "Non-performing exposure (NPE) management includes definition of default under Article 178 CRR with 90 days past due threshold and unlikeliness to pay criteria, classification of non-performing loans (NPL) and non-performing advances, forbearance measures as concessions to borrowers in financial difficulty including payment holidays, term extensions, interest rate reductions, and principal forgiveness, performing and non-performing forborne exposures, probation period before forborne exposures exit non-performing status, cure criteria and return to performing status, NPE coverage ratios and provisioning expectations, NPE reduction strategies and workout processes, distressed debt restructuring, recovery and resolution procedures, collateral enforcement and repossession, loan sales and portfolio transactions, servicing of NPEs, regulatory reporting of asset quality metrics, NPE calendar provisioning backstops requiring time-based provisions, and supervisory expectations on NPE management frameworks under ECB guidance."
  },
  {
    "title": "Counterparty Credit Risk (CCR)",
    "text": "Counterparty credit risk (CCR) arises from derivatives, securities financing transactions (SFT) including repurchase agreements and securities lending, long settlement transactions, and other transactions where future exposure varies with market factors. CCR-specific requirements include calculation of exposure at default using current exposure method (CEM), standardized approach for CCR (SA-CCR), internal model method (IMM), effective expected positive exposure (EEPE), default risk charge for derivatives under Fundamental Review of the Trading Book (FRTB), central counterparty (CCP) exposure treatment and default fund contributions, bilateral margining requirements under EMIR for non-cleared derivatives including initial margin and variation margin, credit valuation adjustment (CVA) risk capital charge, wrong-way risk where exposure increases when counterparty credit quality deteriorates, collateral management for derivatives, netting sets and margin agreements, exposure aggregation across product types, and stress testing of CCR exposures."
  },
  {
    "title": "Securitization Credit Risk",
    "text": "Securitization credit risk involves the transfer of credit risk through structured finance instruments including asset-backed securities (ABS), mortgage-backed securities (MBS), collateralized loan obligations (CLO), and synthetic securitizations. Regulatory framework covers originator, sponsor, and investor requirements, due diligence obligations on underlying exposures, risk retention rules requiring 5% retention of economic interest, prohibition on re-securitization except for asset-backed commercial paper (ABCP), disclosure requirements on underlying pools, homogeneity criteria for securitized portfolios, capital treatment using securitization internal ratings-based approach (SEC-IRBA), securitization external ratings-based approach (SEC-ERBA), and securitization standardized approach (SEC-SA), significant risk transfer (SRT) assessment for regulatory capital relief, senior positions in securitizations, treatment of securitization positions in trading book and banking book, Simple, Transparent and Standardized (STS) securitization framework with preferential capital treatment, and assessment of credit quality steps."
  },
  {
    "title": "Credit Risk Internal Models & IRB Approach",
    "text": "Internal ratings-based (IRB) approach allows banks to use internal models for credit risk capital calculation, covering foundation IRB (F-IRB) where banks estimate probability of default (PD) and supervisors provide loss given default (LGD) and exposure at default (EAD), and advanced IRB (A-IRB) where banks estimate all parameters. Requirements include rating system design with sufficient rating grades and default definition consistency, data requirements with minimum historical observation periods typically five years for PD and seven years for LGD, model validation and backtesting, stress testing and economic downturn LGD estimation, treatment of guarantees and credit derivatives in LGD estimation, default and loss identification, margin of conservatism in parameter estimates, supervisory approval processes, ongoing monitoring and model performance, use test ensuring models are embedded in credit decision-making and management, model governance including independent validation, material model changes and extensions, permanent partial use and rollout plans, and output floor limiting capital benefits."
  },
  {
    "title": "Credit Risk Standardized Approaches & RWA",
    "text": "Standardized approach for credit risk assigns risk weights to exposures based on exposure class and external credit ratings, including sovereigns and central banks typically 0% risk weight, institutions with risk weights varying from 20% to 150% based on credit quality, corporate exposures typically 100% risk weight or rated-based weights, retail exposures at 75% risk weight with granularity criteria, exposures secured by residential mortgages typically 35% risk weight, commercial real estate at higher weights, equity exposures at 100% or higher, off-balance sheet items with credit conversion factors (CCF), unfunded credit protection treatment, and risk weight floors. This includes revised standardized approach under CRR II with increased risk sensitivity, external credit assessment institution (ECAI) mapping, preferential treatment for small and medium enterprises (SME) with SME supporting factor, infrastructure supporting factor, regulatory retail exposures criteria, specialized lending including project finance, object finance, commodities finance, and income-producing real estate, and calculation of total risk-weighted assets (RWA)."
  },
  {
    "title": "Credit Derivatives & Credit Protection",
    "text": "Credit derivatives used for credit risk transfer and hedging include credit default swaps (CDS) providing protection against credit events such as default, bankruptcy, or restructuring, total return swaps exchanging total economic performance, credit-linked notes embedding credit risk, first-to-default baskets, and nth-to-default structures. Requirements cover eligible credit protection under CRM framework, recognition criteria including legal certainty and direct claim on protection provider, credit quality of protection seller with minimum ratings typically A- or equivalent, maturity mismatches and haircuts reducing protection value, currency mismatches between exposure and protection, restructuring credit events and modified restructuring clauses, materiality of restructuring triggers, tranched credit protection with attachment and detachment points, regulatory capital treatment of purchased and sold protection, CVA for credit derivatives, treatment of credit protection in securitizations, central clearing mandates under EMIR, and margining requirements."
  },
  {
    "title": "Credit Risk Stress Testing & Scenario Analysis",
    "text": "Credit risk stress testing assesses portfolio resilience under adverse scenarios including macroeconomic downturns, sector-specific shocks, interest rate stress, unemployment increases, real estate price declines, and commodity price movements. Regulatory requirements include supervisory stress tests such as ECB/EBA stress testing exercises, internal stress testing under ICAAP and ILAAP, reverse stress testing identifying scenarios leading to business model failure, scenario design with baseline, adverse, and severely adverse scenarios, incorporation of second-round effects and feedback loops, assessment of credit migration across rating grades and stages, impact on expected credit losses and provisions, stressed PD, LGD and EAD parameters, concentration risk stress testing, sectoral and geographic stress scenarios, climate-related credit risk stress testing, stress testing of credit risk mitigation effectiveness, management actions and mitigants in stress scenarios, capital and liquidity impact assessment, and documentation and governance of stress testing frameworks."
  }
]
