[
  {
    "title": "Interest Rate Risk in the Trading Book",
    "text": "Interest rate risk in the trading book arises from changes in interest rates affecting the value of trading positions including bonds, interest rate derivatives, and other rate-sensitive instruments. This encompasses delta risk from parallel shifts in yield curves, vega risk from changes in interest rate volatility, curvature risk from non-linear price changes, basis risk between different rate indices such as LIBOR versus OIS, spread risk between government and corporate bonds, and risks across different currencies and tenors. Regulatory requirements include the Fundamental Review of the Trading Book (FRTB) framework with sensitivities-based approach calculating risk charges for delta, vega and curvature across prescribed risk factors and buckets, internal models approach (IMA) subject to profit and loss attribution tests and backtesting, trading desk structure and approval processes, risk factor modellability assessment requiring real prices from multiple independent sources, non-modellable risk factors (NMRF) treatment with stressed calibration, and capital requirements for general interest rate risk and specific risk."
  },
  {
    "title": "Foreign Exchange Risk",
    "text": "Foreign exchange (FX) risk represents exposure to adverse movements in currency exchange rates affecting the value of positions denominated in foreign currencies, including spot FX, FX forwards, FX swaps, currency options, and cross-currency basis swaps. This covers translation risk from converting foreign currency assets and liabilities, transaction risk from future foreign currency cash flows, economic risk from competitive position changes due to exchange rate movements, and risks in both major currency pairs and emerging market currencies. Requirements include calculation of net open foreign exchange positions aggregating long and short positions across currencies, capital charges under standardized approach typically 8% of net open position, treatment of structural FX positions in banking book, gold treatment as foreign currency, FX delta risk, FX vega risk and FX curvature risk under FRTB sensitivities-based approach, correlation assumptions between currency pairs, FX volatility risk from options positions, and stress testing of FX exposures including currency crisis scenarios."
  },
  {
    "title": "Equity Risk",
    "text": "Equity risk arises from changes in equity prices affecting trading book positions in individual stocks, equity indices, equity derivatives including options and futures, equity swaps, and convertible bonds. This encompasses specific risk from individual issuer price movements, general market risk from broad equity market changes, sector concentration risk, geographic market exposures, and volatility risk from equity options. Regulatory framework covers equity delta risk with risk weights varying by market capitalization and liquidity, equity vega risk from implied volatility changes, equity curvature risk from non-linear exposures, correlation between equities within and across buckets based on sectors and regions, treatment of equity indices and index arbitrage positions, equity repo and securities lending exposures, dividend risk, and capital requirements under both standardized and internal models approaches. This includes assessment of large and concentrated equity positions, equity underwriting risk, and equity derivatives including exotic options."
  },
  {
    "title": "Commodity Risk",
    "text": "Commodity risk involves exposure to price changes in physical commodities and commodity derivatives including energy products (crude oil, natural gas, electricity), precious metals (gold, silver, platinum), base metals (copper, aluminum, zinc), agricultural products (wheat, corn, soybeans), and other commodities. This covers directional risk from outright long or short positions, basis risk between different delivery locations or contract specifications, calendar spread risk between different delivery dates, volatility risk from commodity options, and liquidity risk in less liquid commodity markets. Requirements include commodity delta risk with separate treatment across commodity categories, commodity vega risk and curvature risk, correlation assumptions within and between commodity classes, treatment of commodity forwards and futures, energy-specific risks including spark spreads and crack spreads, storage costs and convenience yields, physical delivery obligations, and capital charges under FRTB framework with prescribed risk weights and correlation parameters for different commodity types."
  },
  {
    "title": "Credit Spread Risk in Trading Book",
    "text": "Credit spread risk in the trading book represents exposure to changes in credit spreads affecting the value of corporate bonds, credit derivatives, securitization positions, and other credit-sensitive instruments held for trading. This encompasses spread widening risk from credit quality deterioration, jump-to-default risk from sudden default events, credit migration risk from rating changes, and basis risk between cash bonds and credit default swaps. Regulatory requirements under FRTB include credit spread delta risk with risk weights based on credit quality (investment grade versus high yield), sector, and tenor, credit spread vega risk from credit volatility changes, credit spread curvature risk, correlation between issuers within sectors and across sectors, treatment of securitization positions with separate risk weights, distinction from credit risk in banking book, default risk charge (DRC) capturing jump-to-default risk with prescribed loss-given-default assumptions, and integration with counterparty credit risk for derivatives positions."
  },
  {
    "title": "Value-at-Risk (VaR) & Risk Metrics",
    "text": "Value-at-Risk (VaR) measures the maximum potential loss over a specified time horizon at a given confidence level, typically 99% confidence over 10 trading days for regulatory capital. This encompasses historical simulation VaR using past market movements, parametric VaR assuming normal distributions, Monte Carlo VaR using simulated scenarios, stressed VaR (SVaR) calibrated to a 12-month stressed period, incremental risk charge (IRC) capturing default and migration risk over one-year horizon, and comprehensive risk measure (CRM) for correlation trading. Requirements include daily VaR calculation and reporting, backtesting comparing VaR predictions to actual profit and loss with traffic light approach triggering multiplier increases for excessive breaches, profit and loss attribution tests comparing risk-theoretical P&L to actual P&L, model validation and independent review, treatment of diversification benefits, risk factor selection and proxies, data quality and historical observation periods, and regulatory multiplier (typically 3 or higher) applied to VaR for capital calculation."
  },
  {
    "title": "Trading Book vs Banking Book Boundary",
    "text": "The boundary between trading book and banking book determines which positions are subject to market risk capital requirements versus credit risk capital requirements, with significant implications for capital treatment and risk management. Trading book includes positions held with trading intent, for short-term profit-taking, hedging other trading book positions, or market-making activities, while banking book contains positions held to maturity, relationship banking loans, and structural positions. Regulatory requirements under FRTB include presumptive lists of trading book instruments (derivatives, trading securities) and banking book instruments (loans, deposits), internal risk transfer (IRT) framework allowing hedging between books with strict documentation and approval, prohibition on regulatory arbitrage through artificial assignment, restrictions on switching positions between books, valuation requirements with daily mark-to-market for trading book, prudent valuation adjustments (PVA) for trading book positions, and supervisory approval for trading desk structure and boundary policies."
  },
  {
    "title": "Market Liquidity Risk",
    "text": "Market liquidity risk is the risk that institutions cannot easily offset or eliminate positions without significantly affecting market prices due to inadequate market depth or market disruptions. This encompasses bid-ask spread widening during stress, inability to exit large positions without material price impact, market gaps and discontinuities, reduced trading volumes, and potential for fire sales. Requirements include liquidity horizons in capital calculations with longer horizons for less liquid positions ranging from 10 days for liquid instruments to 120 days for illiquid positions under FRTB, assessment of market depth and concentration, stress testing of market liquidity including scenarios where normal liquidity disappears, contingency planning for illiquid positions, limits on illiquid and concentrated positions, valuation adjustments for illiquid positions, exit strategies and wind-down plans, and distinction between market liquidity risk and funding liquidity risk though recognizing their interaction during stress events."
  },
  {
    "title": "Hedging Strategies & Hedge Accounting",
    "text": "Hedging strategies aim to reduce market risk exposures through offsetting positions, while hedge accounting allows matching of gains and losses on hedging instruments with hedged items. This covers fair value hedges protecting against changes in fair value of assets, liabilities or firm commitments, cash flow hedges protecting against variability in future cash flows, hedges of net investments in foreign operations, micro-hedges of individual exposures, and macro-hedges of portfolios. Requirements under IAS 39 and IFRS 9 include hedge designation and documentation at inception, formal assessment of hedge effectiveness both prospectively and retrospectively, hedge effectiveness testing with 80-125% effectiveness range under IAS 39 or economic relationship under IFRS 9, treatment of hedge ineffectiveness in profit and loss, rebalancing of hedge relationships, discontinuation criteria, dynamic risk management and portfolio hedging approaches, and regulatory treatment of hedging instruments in capital calculations including recognition of hedging benefits and treatment of basis risk."
  },
  {
    "title": "Market Risk Stress Testing & Scenario Analysis",
    "text": "Market risk stress testing evaluates the impact of extreme but plausible market movements on trading portfolios including historical scenarios (2008 financial crisis, COVID-19 market shock), hypothetical scenarios (interest rate shocks, equity crashes, currency crises), and reverse stress tests identifying scenarios causing critical losses. This encompasses multi-factor stress scenarios with simultaneous moves across risk types, correlation breakdown scenarios where diversification benefits disappear, volatility spikes, liquidity stress with widened bid-ask spreads, emerging market crises, sovereign debt crises, and climate-related market shocks. Requirements include regular stress testing at trading desk and firm-wide levels, integration with ICAAP and recovery planning, stress testing of complex and illiquid positions, assessment of concentration risks, second-round effects including margin calls and collateral requirements, management actions in stress scenarios, stress testing governance and independent review, documentation of scenarios and assumptions, and use of stress test results in risk appetite setting, limit frameworks, and strategic decision-making."
  }
]
