[
  {
    "title": "Liquidity Coverage Ratio (LCR)",
    "text": "The Liquidity Coverage Ratio (LCR) requires institutions to maintain sufficient high-quality liquid assets (HQLA) to survive a 30-day acute liquidity stress scenario, with minimum requirement of 100%. HQLA includes Level 1 assets such as central bank reserves, government bonds with 0% haircut, Level 2A assets including covered bonds and corporate bonds rated AA- or higher with 15% haircut capped at 40% of total HQLA, and Level 2B assets including lower-rated corporate bonds, residential mortgage-backed securities, and equities with higher haircuts capped at 15% of total HQLA. Net cash outflows encompass retail deposit runoff rates varying by stability and coverage (3-10% for stable deposits, 10-40% for less stable), wholesale funding runoff rates (typically 100% for unsecured wholesale funding from financial institutions, 25-100% for operational deposits), committed credit and liquidity facilities drawdown assumptions, derivative collateral calls, and contractual obligations. Requirements include daily monitoring and reporting, currency-specific LCR for material currencies, treatment of intragroup transactions, and supervisory expectations for maintaining buffers above minimum."
  },
  {
    "title": "Net Stable Funding Ratio (NSFR)",
    "text": "The Net Stable Funding Ratio (NSFR) promotes stable funding structures by requiring available stable funding (ASF) to exceed required stable funding (RSF) over a one-year horizon, with minimum 100% requirement. ASF includes capital and liabilities with remaining maturity over one year receiving 100% ASF factor, stable retail deposits and certain wholesale deposits receiving 90-95% factors, less stable deposits receiving 90% factor, and wholesale funding with maturity under one year receiving lower factors (50% for operational deposits, 0% for other short-term wholesale funding). RSF depends on asset liquidity and remaining maturity, with cash and central bank reserves requiring 0% RSF, government bonds requiring 5% RSF, covered bonds and corporate bonds requiring 15-50% RSF depending on rating and maturity, performing loans requiring 65-85% RSF, and unencumbered assets available for immediate sale or pledging receiving lower RSF factors. This includes treatment of derivatives, off-balance sheet exposures, interdependencies with LCR, and restrictions on double-counting of liquid assets."
  },
  {
    "title": "Intraday Liquidity Management",
    "text": "Intraday liquidity management ensures institutions can meet payment and settlement obligations throughout the business day without disrupting operations or incurring losses. This encompasses real-time monitoring of intraday liquidity positions across accounts, payment systems (TARGET2, CHAPS, Fedwire), and currencies, management of payment flows and timing, optimization of collateral usage for intraday credit facilities, coordination between treasury and operations, and contingency arrangements for intraday stress. Requirements include identification of peak intraday liquidity needs, monitoring of time-specific obligations including large-value payments and securities settlements, assessment of available intraday liquidity sources such as central bank facilities and correspondent banking arrangements, collateral mobilization capabilities, stress testing of intraday liquidity including operational disruptions and participant defaults in payment systems, governance and escalation procedures for intraday liquidity issues, and reporting obligations to supervisors on intraday liquidity risk management frameworks and key metrics."
  },
  {
    "title": "Contingency Funding Plan & Stress Testing",
    "text": "Contingency funding plans (CFP) establish strategies and procedures for responding to liquidity stress events, ensuring institutions can continue to meet obligations during disruptions. This includes identification of early warning indicators such as credit rating downgrades, widening CDS spreads, increased funding costs, deposit outflows, and negative media coverage, escalation procedures and crisis management governance with clear roles and responsibilities, quantification of liquidity needs under stress scenarios ranging from institution-specific stress to market-wide crises, inventory of available liquidity sources including unencumbered assets, committed facilities, and central bank access, prioritization of actions including asset sales, liability management, and curtailment of activities, communication strategies with stakeholders including regulators, rating agencies, and counterparties, and regular testing and updating of plans. Stress testing encompasses idiosyncratic scenarios (reputation events, credit downgrades), market-wide scenarios (market disruptions, funding market freezes), combined scenarios, reverse stress tests, and assessment of funding concentrations, rollover risks, and contingent liquidity obligations."
  },
  {
    "title": "Maturity Transformation & Funding Gaps",
    "text": "Maturity transformation involves funding long-term assets with shorter-term liabilities, creating maturity mismatches and rollover risk. This encompasses contractual maturity analysis showing legal maturity dates of assets and liabilities, behavioral maturity analysis incorporating expected customer behavior such as deposit stability and loan prepayments, cumulative funding gap analysis across time buckets identifying periods of net cash outflows, and assessment of refinancing risk when significant liabilities mature. Requirements include maturity ladder reporting across standardized time buckets from overnight to over 5 years, limits on maturity mismatches and cumulative gaps, distinction between liquid and illiquid assets in gap analysis, treatment of off-balance sheet items and contingent obligations, scenario analysis of behavioral assumptions under stress, assessment of term funding needs, diversification of maturity profile avoiding excessive concentration in specific maturity buckets, and integration with interest rate risk in banking book (IRRBB) management given the interaction between maturity transformation and interest rate exposure."
  },
  {
    "title": "Funding Concentration & Diversification",
    "text": "Funding concentration risk arises from over-reliance on specific funding sources, counterparties, instruments, currencies, or markets, creating vulnerability if access is disrupted. This includes concentration to individual depositors or creditors with limits typically set relative to total funding or capital, concentration to funding instruments such as excessive reliance on short-term wholesale funding, commercial paper, or repos, concentration to specific markets or currencies creating rollover risk if market access is impaired, concentration to related counterparties or groups, and time concentration with large amounts maturing simultaneously. Requirements include identification and monitoring of funding concentrations across multiple dimensions, limits on concentrations with escalation when approaching thresholds, diversification strategies across funding sources, instruments, tenors, currencies, and investor types, assessment of funding market capacity and institution's share, contingency plans for loss of concentrated funding sources, stress testing of concentration risks, and regular reporting to senior management and board on funding composition and concentration metrics."
  },
  {
    "title": "Asset Encumbrance & Collateral Management",
    "text": "Asset encumbrance occurs when assets are pledged as collateral or otherwise restricted, reducing available unencumbered assets for liquidity management and potentially signaling financial stress. This encompasses encumbrance from secured funding transactions including covered bonds, securitizations, and repos, collateral posted for derivatives under CSA agreements, margin requirements for centrally cleared derivatives, assets pledged to central banks for access to facilities, and assets backing deposit guarantee schemes. Requirements include monitoring and reporting of encumbrance levels with metrics such as encumbered assets as percentage of total assets (supervisory expectations typically below 25-30% in normal times), distinction between encumbered and unencumbered assets by quality and liquidity, assessment of over-collateralization in secured funding, collateral upgrade and downgrade triggers, collateral substitution rights, legal and operational arrangements for mobilizing collateral, stress testing of encumbrance including scenarios with increased margin calls and haircuts, disclosure requirements on asset encumbrance, and management of encumbrance levels to maintain sufficient unencumbered HQLA for LCR compliance."
  },
  {
    "title": "Deposit Stability & Retail Funding",
    "text": "Deposit stability analysis assesses the reliability of retail and corporate deposits as funding sources, considering customer behavior during normal and stressed conditions. This includes classification of retail deposits into stable deposits (covered by deposit guarantee schemes, established customer relationships, transactional accounts) receiving lower runoff rates, and less stable deposits (high-value accounts, internet-only accounts, non-resident deposits) with higher runoff assumptions, analysis of corporate operational deposits from clearing, custody, and cash management services receiving preferential treatment due to stickiness, and assessment of wholesale deposits from financial institutions and corporates typically assumed to run off rapidly in stress. Requirements include granular deposit analysis by customer segment, product type, coverage by deposit guarantee schemes, and geographic location, monitoring of deposit concentration to large depositors, early warning indicators of deposit flight such as declining balances or increased withdrawal requests, pricing strategies balancing funding needs with profitability, customer relationship management to enhance stickiness, stress testing of deposit runoff under various scenarios, and validation of behavioral assumptions through historical analysis and peer benchmarking."
  },
  {
    "title": "Wholesale Funding & Market Access",
    "text": "Wholesale funding includes unsecured and secured borrowing from financial institutions, corporates, and institutional investors through instruments such as interbank deposits, commercial paper, certificates of deposit, medium-term notes, covered bonds, securitizations, and repos. This encompasses assessment of wholesale funding stability with recognition that most wholesale funding is less stable than retail deposits, diversification across investor types and markets, term funding strategies to reduce rollover frequency, relationship management with key investors and counterparties, and monitoring of market conditions and access. Requirements include limits on wholesale funding as percentage of total funding, minimum term funding requirements, monitoring of rollover success rates and funding costs as early warning indicators, assessment of funding capacity in different markets, contingency arrangements for loss of market access, participation in multiple funding markets to maintain optionality, credit rating considerations given investor requirements, disclosure and transparency to maintain investor confidence, and stress testing of wholesale funding availability including scenarios where markets freeze or become accessible only at prohibitive costs."
  },
  {
    "title": "Central Bank Facilities & Lender of Last Resort",
    "text": "Central bank facilities provide liquidity support through standing facilities, open market operations, and emergency lending, serving as backstop for solvent institutions facing temporary liquidity stress. This includes standing deposit and lending facilities available at penalty rates, main refinancing operations providing regular liquidity against eligible collateral, longer-term refinancing operations (LTRO, TLTRO) with extended maturities, marginal lending facilities for overnight borrowing, discount window access in some jurisdictions, and emergency liquidity assistance (ELA) for solvent institutions facing acute stress. Requirements include maintaining operational readiness to access facilities through pre-positioning of collateral, understanding eligibility criteria for collateral with haircuts applied based on asset quality and liquidity, legal documentation and operational procedures, regular testing of access mechanisms, assessment of available collateral and potential borrowing capacity, treatment of central bank funding in liquidity metrics (typically not counted as stable funding in NSFR, but eligible collateral supports LCR), stigma considerations that may deter usage during stress, and coordination with supervisors given that emergency access may trigger enhanced oversight."
  }
]
