[
  {
    "title": "Internal Fraud",
    "text": "Internal fraud involves intentional acts by employees or insiders to defraud, misappropriate assets, or circumvent regulations, laws, or company policies, excluding discrimination and diversity events. This encompasses unauthorized trading activities including rogue trading and exceeding position limits, theft and embezzlement of cash or assets, fraudulent loan origination or credit decisions for personal benefit, manipulation of financial records or reporting, bribery and kickbacks from vendors or customers, insider trading using confidential information, falsification of documents or signatures, unauthorized access to systems or data for fraudulent purposes, and collusion between employees or with external parties. Prevention and detection measures include segregation of duties preventing single individuals from controlling entire processes, maker-checker controls requiring independent verification, access controls and system permissions based on least privilege principle, monitoring of employee activities and transactions for unusual patterns, whistleblower programs and anonymous reporting channels, background checks and screening during hiring, mandatory vacation policies forcing job rotation, regular audits and surprise inspections, and disciplinary procedures including termination and legal action when fraud is detected."
  },
  {
    "title": "External Fraud",
    "text": "External fraud results from intentional acts by third parties to defraud, misappropriate assets, or circumvent laws, including theft, robbery, forgery, check kiting, and electronic fraud. This encompasses payment fraud including card fraud, check fraud, and wire transfer fraud, identity theft and account takeover where criminals impersonate legitimate customers, phishing and social engineering attacks tricking employees or customers into revealing credentials or authorizing transactions, business email compromise (BEC) targeting payment processes, ATM skimming and physical theft, counterfeit currency and instruments, loan fraud with false information or documentation, insurance fraud with false claims, vendor and supplier fraud, and money laundering attempts using the institution. Controls include customer authentication mechanisms such as multi-factor authentication, transaction monitoring systems detecting unusual patterns, velocity checks limiting transaction frequency and amounts, verification procedures for high-risk transactions, employee training on fraud indicators and social engineering tactics, collaboration with law enforcement and industry groups, fraud detection analytics using machine learning, customer education on security practices, and incident response procedures for confirmed fraud including account freezing, fund recovery, and regulatory reporting."
  },
  {
    "title": "Employment Practices & Workplace Safety",
    "text": "Employment practices and workplace safety risk arises from acts inconsistent with employment, health, or safety laws or agreements, including workers compensation claims, discrimination, harassment, and workplace safety violations. This includes discrimination based on protected characteristics such as race, gender, age, religion, or disability in hiring, promotion, compensation, or termination decisions, sexual harassment and hostile work environment, wrongful termination and unfair dismissal claims, violation of labor laws including wage and hour regulations, failure to provide safe working conditions leading to injuries or occupational illnesses, inadequate training on safety procedures and equipment, non-compliance with health and safety regulations, retaliation against whistleblowers or complainants, failure to accommodate disabilities, and violations of employee privacy rights. Risk management includes comprehensive employment policies and codes of conduct, regular training on discrimination, harassment, and workplace safety, clear reporting mechanisms and investigation procedures for complaints, health and safety programs with risk assessments and protective equipment, workers compensation insurance, legal review of employment decisions, documentation of performance issues and disciplinary actions, diversity and inclusion initiatives, ergonomic assessments, and regular audits of compliance with employment and safety regulations."
  },
  {
    "title": "Clients, Products & Business Practices",
    "text": "Risks from clients, products, and business practices include unintentional or negligent failures to meet professional obligations to clients, or from the nature or design of products. This encompasses mis-selling of products unsuitable for customer needs or risk profiles, inadequate disclosure of product features, risks, or costs, breach of fiduciary duties or advisory obligations, improper sales practices including aggressive tactics or misleading representations, product design flaws creating unexpected risks or customer detriment, inadequate product governance and oversight, failure to conduct suitability or appropriateness assessments, conflicts of interest not properly managed or disclosed, churning or excessive trading generating commissions, unauthorized trading or exceeding customer mandates, errors in account administration or transaction processing, failure to execute customer instructions properly, privacy breaches exposing customer information, and reputational damage from poor customer outcomes. Controls include robust product approval processes with customer outcome assessments, suitability and appropriateness testing frameworks, clear product documentation and disclosure, sales process monitoring and quality assurance, training and competence requirements for customer-facing staff, conflicts of interest policies, complaint handling and root cause analysis, regular product reviews, mystery shopping programs, and regulatory compliance monitoring."
  },
  {
    "title": "Damage to Physical Assets",
    "text": "Damage to physical assets results from natural disasters or other events causing loss or damage to physical property including buildings, equipment, and infrastructure. This encompasses natural disasters such as earthquakes, floods, hurricanes, tornadoes, and wildfires, terrorism and vandalism, fire and explosions, water damage from burst pipes or flooding, power failures and electrical issues, structural failures or building collapse, damage to IT infrastructure and data centers, damage to ATMs and branch facilities, loss of transportation assets, and environmental contamination. Risk mitigation includes property insurance with adequate coverage limits and appropriate deductibles, business continuity planning with alternate facilities and work arrangements, preventive maintenance programs, physical security measures including surveillance and access controls, fire suppression and detection systems, backup power generators and uninterruptible power supplies (UPS), geographic diversification of critical facilities, building standards and seismic reinforcement in high-risk areas, emergency response procedures, regular inspections and risk assessments of facilities, and coordination with emergency services and authorities."
  },
  {
    "title": "Business Disruption & System Failures",
    "text": "Business disruption and system failures involve disruption of business operations or system failures including hardware, software, telecommunications, and utility outages. This encompasses IT system outages affecting core banking systems, payment processing, or trading platforms, hardware failures including servers, storage, and network equipment, software bugs and application errors, telecommunications failures disrupting connectivity, utility outages including power, water, or HVAC systems, capacity issues from insufficient system resources, performance degradation affecting service levels, failed system changes or upgrades, integration issues between systems, vendor or third-party service provider failures, cloud service disruptions, and cascading failures where one system failure triggers others. Resilience measures include redundant systems and failover capabilities, high availability architectures with no single points of failure, disaster recovery sites with regular testing, backup and recovery procedures with defined recovery time objectives (RTO) and recovery point objectives (RPO), change management processes with testing and rollback procedures, capacity planning and performance monitoring, incident management and escalation procedures, vendor management with service level agreements (SLAs) and penalties, regular system maintenance and patching, and business continuity arrangements ensuring critical services continue during disruptions."
  },
  {
    "title": "Execution, Delivery & Process Management",
    "text": "Execution, delivery, and process management failures result from failed transaction processing, process management errors, or disputes with trade counterparties and vendors. This includes transaction processing errors such as incorrect payments, duplicate transactions, or failed settlements, data entry mistakes and manual processing errors, reconciliation breaks and unmatched items, failed or delayed trade settlements, collateral management errors, corporate actions processing failures, reference data errors affecting pricing or risk calculations, document management failures including lost or misfiled documents, service level agreement breaches, vendor disputes over services or pricing, customer disputes over transactions or fees, operational losses from process inefficiencies, and errors in regulatory reporting. Controls include straight-through processing (STP) reducing manual intervention, automated reconciliations with exception reporting, four-eyes principle for critical transactions, transaction limits and approval authorities, process documentation and standard operating procedures, quality assurance and control checks, exception management and investigation procedures, key risk indicators (KRIs) monitoring error rates and processing times, root cause analysis of errors, process improvement initiatives including lean and six sigma methodologies, and training programs ensuring staff competence."
  },
  {
    "title": "Outsourcing & Third-Party Risk",
    "text": "Outsourcing and third-party risk arises from reliance on external service providers for critical functions, creating dependencies and potential vulnerabilities. This encompasses IT outsourcing including cloud services, data centers, and application development, business process outsourcing such as payment processing, customer service, and back-office functions, professional services including legal, audit, and consulting, concentration risk from critical service providers, vendor financial stability and business continuity, data security and confidentiality at vendor sites, compliance with regulations by vendors, subcontracting and fourth-party risk, vendor lock-in and exit challenges, and cross-border outsourcing with jurisdictional issues. Risk management includes due diligence before vendor selection assessing capabilities, financial strength, security, and compliance, contractual protections including service levels, audit rights, data ownership, termination rights, and liability provisions, ongoing monitoring of vendor performance against SLAs, regular audits and assessments of vendor controls, business continuity requirements for vendors, information security requirements and testing, exit strategies and transition planning, vendor concentration limits, regulatory compliance including outsourcing notifications to supervisors, and governance with clear accountability for outsourced activities remaining with the institution."
  },
  {
    "title": "Legal & Regulatory Risk",
    "text": "Legal and regulatory risk involves exposure to fines, penalties, or punitive damages resulting from supervisory actions or private settlements due to non-compliance with laws, regulations, or legal obligations. This encompasses violations of banking regulations including capital, liquidity, and large exposure requirements, anti-money laundering (AML) and counter-terrorist financing (CTF) breaches, sanctions violations and prohibited transactions, consumer protection violations, data protection and privacy breaches under GDPR or similar regulations, securities law violations, tax non-compliance, contractual disputes and litigation, intellectual property infringement, competition law violations, employment law breaches, and failure to obtain required licenses or approvals. Management includes legal and compliance functions with sufficient resources and authority, regulatory change management processes tracking and implementing new requirements, compliance monitoring and testing programs, legal review of products, services, and contracts, training on legal and regulatory obligations, policies and procedures aligned with legal requirements, incident reporting to regulators within required timeframes, engagement with regulators and supervisors, legal reserves for known litigation, and insurance coverage for legal risks where available."
  },
  {
    "title": "Operational Resilience & Business Continuity",
    "text": "Operational resilience ensures critical operations and services remain within tolerance levels during disruption, enabling institutions to continue serving customers and meeting obligations. This encompasses identification of important business services based on customer impact, financial stability implications, and regulatory requirements, setting impact tolerances defining maximum acceptable disruption for each service, mapping dependencies including people, processes, technology, facilities, and third parties supporting critical services, scenario testing with severe but plausible disruptions including cyber attacks, pandemics, natural disasters, and loss of key infrastructure, response and recovery capabilities to restore services within tolerance, communication strategies with customers, regulators, and stakeholders during disruption, lessons learned and continuous improvement from incidents and tests, and governance with board and senior management oversight. Requirements under operational resilience frameworks include self-assessment of resilience capabilities, identification of vulnerabilities and single points of failure, investment in resilience improvements, documentation of playbooks and procedures, regular testing at least annually with realistic scenarios, coordination across business lines and support functions, third-party resilience requirements, and regulatory reporting on resilience capabilities and material incidents."
  }
]
