[
  {
    "title": "Common Equity Tier 1 (CET1) Capital",
    "text": "Common Equity Tier 1 (CET1) capital represents the highest quality capital consisting primarily of common shares, retained earnings, accumulated other comprehensive income (AOCI), and other disclosed reserves, subject to regulatory adjustments and deductions. This encompasses paid-in common stock meeting criteria including perpetual nature, subordination to all other claims, discretionary dividends, and full loss absorption, retained earnings accumulated over time from profitable operations, other comprehensive income including fair value reserves, regulatory adjustments reducing CET1 including goodwill and intangible assets, deferred tax assets relying on future profitability, cash flow hedge reserves, gains on sale related to securitizations, defined benefit pension fund assets, own credit risk adjustments on fair valued liabilities, insufficient provisions relative to expected losses under IRB approach, and reciprocal cross-holdings in financial institutions. Requirements include minimum CET1 ratio of 4.5% of risk-weighted assets, additional buffers increasing effective minimum, restrictions on distributions when buffers are breached through maximum distributable amount (MDA) mechanism, disclosure of capital composition and reconciliation to accounting balance sheet, and supervisory assessment of capital quality."
  },
  {
    "title": "Additional Tier 1 (AT1) Capital",
    "text": "Additional Tier 1 (AT1) capital consists of instruments subordinated to depositors and general creditors, capable of absorbing losses while the institution remains a going concern, typically through write-down or conversion to equity when capital ratios fall below triggers. This includes perpetual subordinated instruments with no maturity date or incentive to redeem, discretionary coupon payments that can be cancelled without triggering default or acceleration, principal loss absorption through temporary or permanent write-down or conversion to common equity, trigger levels typically set at 5.125% CET1 ratio for write-down or conversion, full subordination to depositors and senior creditors, call options only after minimum five years and subject to supervisory approval, and restrictions on distributions when capital buffers are breached. Regulatory requirements include minimum Tier 1 capital ratio (CET1 plus AT1) of 6% of RWA, eligibility criteria ensuring genuine loss absorption, grandfathering provisions for legacy instruments not meeting current criteria, limits on recognition of AT1 issued by subsidiaries, and assessment of trigger mechanisms and loss absorption features ensuring effectiveness during stress."
  },
  {
    "title": "Tier 2 Capital & Subordinated Debt",
    "text": "Tier 2 capital provides additional loss absorption on a gone-concern basis, primarily consisting of subordinated debt instruments and certain loan loss provisions. This encompasses subordinated debt with original maturity of at least five years, subordinated to depositors and general creditors but ranking above equity and AT1 instruments, amortization in final five years of maturity reducing recognition by 20% per year, general provisions or loan loss allowances for standardized approach exposures up to 1.25% of credit RWA, revaluation reserves for certain assets, and instruments issued by subsidiaries subject to limits. Requirements include minimum total capital ratio (Tier 1 plus Tier 2) of 8% of RWA, eligibility criteria for Tier 2 instruments including lock-in clauses preventing payment of coupons if capital falls below minimum, prohibition on credit-sensitive features linking coupon to institution's credit rating, call options only after five years and with supervisory approval, loss absorption through statutory write-down or conversion mechanisms in resolution, and limits on inclusion of excess provisions and subsidiary-issued capital in consolidated Tier 2."
  },
  {
    "title": "Capital Conservation Buffer",
    "text": "The capital conservation buffer requires institutions to hold CET1 capital above minimum requirements to absorb losses during stress while maintaining capacity to lend, set at 2.5% of RWA above the minimum 4.5% CET1 requirement. This creates an effective CET1 minimum of 7% in normal times, with the buffer designed to be drawn down during stress periods when losses erode capital, followed by rebuilding through earnings retention during recovery. When the buffer is breached, institutions face restrictions on discretionary distributions including dividends, share buybacks, and variable compensation through the maximum distributable amount (MDA) framework. MDA calculation depends on the extent of buffer breach, with four quartiles determining the maximum percentage of distributable items that can be paid, ranging from 60% when in the top quartile to 0% when CET1 falls below minimum requirements. Requirements include buffer maintenance in normal times, automatic restrictions without need for supervisory intervention when breached, capital planning ensuring buffer adequacy, stress testing assessing buffer sufficiency, disclosure of buffer levels and compliance, and supervisory expectations that institutions operate above combined buffer requirements to avoid restrictions and maintain market confidence."
  },
  {
    "title": "Countercyclical Capital Buffer (CCyB)",
    "text": "The countercyclical capital buffer (CCyB) varies between 0% and 2.5% of RWA based on credit cycle conditions, increasing during periods of excessive credit growth to build resilience and decreasing during downturns to support lending. National authorities set CCyB rates for their jurisdictions based on indicators including credit-to-GDP gap, credit growth rates, asset prices, and supervisory judgment, with institutions calculating their institution-specific buffer as weighted average of buffers in jurisdictions where they have credit exposures. This encompasses buffer accumulation during credit booms when systemic risks build, buffer release during stress to absorb losses and maintain lending capacity, reciprocity arrangements where authorities recognize foreign CCyB rates, and communication of buffer decisions with pre-announcement period typically 12 months before increases take effect. Requirements include quarterly calculation of institution-specific CCyB based on geographic distribution of credit exposures, compliance with combined buffer requirement including CCyB, MDA restrictions when combined buffer is breached, disclosure of CCyB exposure by jurisdiction, and supervisory assessment of credit cycle conditions and systemic risk indicators informing buffer decisions."
  },
  {
    "title": "Systemic Risk Buffers & G-SII/O-SII",
    "text": "Systemic risk buffers apply to systemically important institutions whose failure would have significant negative externalities on the financial system and real economy. Global systemically important institutions (G-SIIs) face additional CET1 requirements ranging from 1% to 3.5% based on systemic importance scores considering size, interconnectedness, substitutability, complexity, and cross-border activity, with annual assessment and publication of G-SII list. Other systemically important institutions (O-SIIs) designated at national level face buffers typically 0% to 2% based on domestic systemic importance, with authorities considering size relative to domestic economy, importance for domestic financial system, and complexity. This includes higher loss absorbency requirements reflecting greater risk to financial stability, expectations for enhanced supervision and resolution planning, resolvability assessments ensuring orderly failure without taxpayer support, and potential additional requirements for institutions approaching G-SII threshold. Requirements include annual assessment and notification of systemic importance designation, phase-in periods for newly designated institutions, disclosure of systemic importance scores and buffer requirements, enhanced supervision including more frequent reporting and on-site inspections, and recovery and resolution planning with credible strategies for failure scenarios."
  },
  {
    "title": "Leverage Ratio",
    "text": "The leverage ratio serves as non-risk-based backstop to risk-weighted capital requirements, calculated as Tier 1 capital divided by total exposure measure, with minimum requirement of 3% and higher requirements for systemically important institutions. Total exposure measure includes on-balance sheet exposures at accounting value without risk weighting, derivatives exposures calculated using standardized approach for counterparty credit risk (SA-CCR) or replacement cost plus potential future exposure, securities financing transactions (SFT) using comprehensive approach with supervisory haircuts or own estimates, and off-balance sheet items with credit conversion factors typically 10% for commitments or 100% for guarantees. This encompasses treatment of central bank reserves included in exposure measure, netting benefits for derivatives and SFT subject to enforceable agreements, exclusion of certain items such as accounting provisions, and calibration to limit excessive leverage while not unduly constraining low-risk activities. Requirements include quarterly calculation and disclosure of leverage ratio and components, minimum 3% requirement with potential for higher buffers, restrictions on distributions when leverage ratio falls below requirements, supervisory monitoring of leverage trends and business model implications, and assessment of whether risk-weighted or leverage ratio is binding constraint on capital."
  },
  {
    "title": "MREL & TLAC Requirements",
    "text": "Minimum requirement for own funds and eligible liabilities (MREL) and total loss-absorbing capacity (TLAC) ensure institutions have sufficient loss-absorbing and recapitalization capacity to support resolution without taxpayer support. TLAC applies to G-SIIs requiring minimum 18% of RWA and 6.75% of leverage exposure from January 2022, consisting of regulatory capital plus eligible subordinated liabilities meeting criteria including sufficient subordination, minimum remaining maturity of one year, and no set-off rights. MREL applies more broadly with requirements set institution-specifically based on resolution strategy, typically requiring loss absorption amount to cover losses and recapitalization amount to restore market confidence post-resolution, with subordination requirements ensuring bail-in without contagion to senior creditors. This encompasses eligible instruments including capital, subordinated debt, and potentially senior debt if sufficiently subordinated, internal MREL for material subsidiaries ensuring loss absorption at entity level, and transitional arrangements with phase-in periods. Requirements include calculation of MREL/TLAC ratios, issuance of eligible instruments to meet requirements, disclosure of MREL/TLAC composition and compliance, resolution planning ensuring effective use of loss-absorbing capacity, and contractual recognition of bail-in for instruments governed by non-EU law."
  },
  {
    "title": "Capital Planning & Stress Testing",
    "text": "Capital planning ensures institutions maintain adequate capital under baseline and stress scenarios, supporting business strategy while meeting regulatory requirements and market expectations. This encompasses forward-looking capital projections over multi-year planning horizon typically three to five years, baseline scenario reflecting expected business performance and economic conditions, stress scenarios including supervisory scenarios from ECB/EBA stress tests and institution-specific scenarios, assessment of capital generation through retained earnings and capital consumption from RWA growth and losses, evaluation of capital actions including dividends, buybacks, and issuance, and contingency planning for capital shortfalls. Supervisory stress testing includes common scenarios applied across institutions enabling peer comparison, assessment of capital adequacy under adverse conditions, evaluation of risk management and governance, and potential supervisory actions if capital inadequate including Pillar 2 requirements, restrictions on distributions, or requirements for capital raising. Requirements include annual capital planning process with board approval, stress testing at least annually with severe but plausible scenarios, documentation of assumptions and methodologies, integration with business planning and risk appetite, reverse stress testing identifying scenarios causing capital to fall below minimum, and supervisory review of capital plans and stress test results."
  },
  {
    "title": "Internal Capital Adequacy Assessment (ICAAP)",
    "text": "Internal Capital Adequacy Assessment Process (ICAAP) requires institutions to assess capital adequacy relative to risk profile, considering all material risks including those not fully captured in Pillar 1 requirements. This encompasses identification and assessment of material risks including credit, market, operational, interest rate risk in banking book (IRRBB), concentration risk, business risk, strategic risk, reputational risk, and other institution-specific risks, quantification of capital needs for material risks using internal models, stress testing, or other methodologies, assessment of capital adequacy under current and forward-looking scenarios, evaluation of capital management and planning processes, and documentation of ICAAP framework and results. Supervisory Review and Evaluation Process (SREP) assesses ICAAP quality and determines Pillar 2 requirements (P2R) as binding minimum capital add-ons for risks not adequately covered in Pillar 1, and Pillar 2 guidance (P2G) as non-binding supervisory expectations for additional capital. Requirements include proportionate ICAAP appropriate to size, complexity, and risk profile, annual update and submission to supervisors, board and senior management ownership, independent validation and review, integration with risk management and business planning, stress testing and scenario analysis, assessment of risk concentrations and diversification effects, and documentation of methodologies, assumptions, and governance arrangements."
  }
]
