[
  {
    "title": "Large Exposures & Single Name Concentration",
    "text": "Large exposures framework limits concentration to individual counterparties or groups of connected clients to prevent excessive loss from single obligor default. The fundamental limit restricts exposures to single counterparties to 25% of eligible capital, with lower 10% limit for exposures between G-SIIs to reduce interconnectedness in the financial system. Exposure value includes all on-balance sheet and off-balance sheet exposures after credit risk mitigation, with derivatives calculated using counterparty credit risk methods, securities financing transactions included, and exposures to connected clients aggregated based on control relationships or economic interdependence. This encompasses identification of groups of connected clients through ownership links, control relationships, or economic dependencies where financial difficulties of one would cause difficulties for others, exemptions for certain exposures including intragroup exposures subject to conditions, exposures to central governments and central banks, covered bonds meeting eligibility criteria, and trade finance exposures with short maturity. Requirements include daily monitoring of large exposures, reporting to supervisors of all exposures exceeding 10% of eligible capital, prior supervisory approval for exposures exceeding limits in exceptional circumstances, systems and controls for identifying connected clients, and governance with board-level oversight of concentration risk."
  },
  {
    "title": "Sectoral & Industry Concentration",
    "text": "Sectoral concentration risk arises from excessive exposure to specific industries or economic sectors that may be affected by common risk factors, creating correlated losses during sector-specific downturns. This includes concentration to real estate sector including commercial real estate, residential mortgages, and construction lending, energy sector exposures to oil and gas, renewables, and utilities, financial sector exposures to banks, insurance companies, and other financial institutions, retail and consumer sectors, manufacturing and industrial sectors, technology and telecommunications, agriculture and commodities, shipping and transportation, and sovereign and public sector exposures. Assessment encompasses identification of material sector concentrations relative to total portfolio and capital, analysis of sector-specific risk drivers including regulatory changes, technological disruption, commodity prices, and economic cycles, stress testing of sector concentrations under adverse scenarios specific to each sector, correlation analysis examining co-movement of defaults within sectors, and diversification metrics measuring portfolio granularity. Risk management includes sector limits and risk appetite thresholds, enhanced due diligence for concentrated sectors, sector-specific expertise and monitoring, early warning indicators for sector deterioration, and capital allocation reflecting concentration risk through Pillar 2 assessments."
  },
  {
    "title": "Geographic & Country Concentration",
    "text": "Geographic concentration risk involves excessive exposure to specific countries, regions, or geographic areas, creating vulnerability to localized economic shocks, political events, natural disasters, or regulatory changes. This encompasses country risk from sovereign default or political instability, transfer risk preventing cross-border payments due to foreign exchange restrictions or capital controls, regional economic concentration to specific economic zones or trading blocs, emerging market exposures with higher volatility and political risk, concentration to home country creating domestic economic dependency, cross-border exposures requiring assessment of legal enforceability and recovery prospects, and correlation of defaults within geographic regions during regional crises. Assessment includes country risk ratings from external agencies and internal assessments, exposure measurement including direct exposures and indirect exposures through guarantees or collateral, stress testing of geographic concentrations under country-specific and regional scenarios, analysis of economic fundamentals including GDP growth, fiscal position, external debt, and political stability, and monitoring of early warning indicators such as credit default swap spreads, currency depreciation, and capital outflows. Risk management encompasses country limits and risk appetite by country risk rating, diversification strategies across geographies, hedging of country risk through credit derivatives or political risk insurance, enhanced monitoring of high-risk countries, and contingency planning for country crises including exposure reduction strategies."
  },
  {
    "title": "Intra-Financial System Exposures",
    "text": "Intra-financial system exposures represent concentration risk from interconnectedness between financial institutions, creating potential for contagion and systemic risk amplification during stress. This includes interbank exposures from unsecured lending, deposits, and credit lines between banks, exposures to other financial institutions including insurance companies, asset managers, and hedge funds, central counterparty (CCP) exposures from clearing membership and default fund contributions, correspondent banking relationships, securities financing transactions with financial counterparties, derivative exposures to financial institutions, and indirect exposures through common asset holdings or funding sources. Regulatory framework includes reduced large exposure limit of 10% of eligible capital for exposures between G-SIIs, enhanced monitoring of financial sector concentration, assessment of interconnectedness in systemic risk evaluations, and resolution planning considering financial sector exposures. Risk management encompasses limits on financial sector concentration, counterparty credit risk assessment of financial institutions, monitoring of financial sector stress indicators, diversification of banking relationships and funding sources, collateralization of exposures to financial counterparties, stress testing of financial sector concentration including scenarios where multiple financial institutions fail simultaneously, and contingency planning for loss of key financial sector relationships."
  },
  {
    "title": "Product & Asset Class Concentration",
    "text": "Product and asset class concentration risk arises from excessive exposure to specific lending products, asset types, or financial instruments that may be affected by common risk factors or market conditions. This encompasses concentration to specific loan products such as commercial real estate loans, residential mortgages, consumer loans, credit cards, or auto loans, concentration to asset classes including corporate bonds, sovereign bonds, equities, or structured products, concentration to specific collateral types affecting recovery rates, concentration to particular derivative products or trading strategies, and concentration to securitization exposures or off-balance sheet vehicles. Assessment includes measurement of product concentrations relative to total assets and capital, analysis of product-specific risk characteristics including credit quality, maturity profile, and loss history, stress testing of product concentrations under adverse scenarios affecting specific products, correlation analysis of defaults or losses within product categories, and evaluation of diversification benefits across products. Risk management encompasses product limits and risk appetite by asset class, product approval processes assessing concentration implications, portfolio rebalancing strategies to reduce concentrations, capital allocation for product concentration risk under Pillar 2, monitoring of product performance metrics and early warning indicators, and strategic planning considering product diversification objectives."
  },
  {
    "title": "Funding Source Concentration",
    "text": "Funding source concentration creates liquidity and refinancing risk from over-reliance on specific funding providers, instruments, or markets, making the institution vulnerable if access is disrupted. This includes concentration to individual depositors or deposit-taking relationships, concentration to specific wholesale funding providers or investor types, concentration to particular funding instruments such as commercial paper, covered bonds, or securitizations, concentration to specific funding markets or currencies, concentration to related parties or group entities, and time concentration with large amounts maturing simultaneously. Assessment encompasses identification of material funding concentrations across multiple dimensions, measurement of concentration metrics including Herfindahl index for depositor concentration, analysis of funding stability and rollover risk for concentrated sources, stress testing of funding concentration under scenarios where concentrated sources are lost, and evaluation of funding market capacity and institution's market share. Risk management includes limits on funding concentrations with escalation procedures, diversification strategies across funding sources, instruments, tenors, and markets, relationship management with key funding providers, contingency funding plans addressing loss of concentrated sources, monitoring of funding costs and availability as early warning indicators, and strategic funding planning promoting diversification while balancing cost efficiency."
  },
  {
    "title": "Currency Concentration",
    "text": "Currency concentration risk involves excessive exposure to specific foreign currencies in assets, liabilities, or off-balance sheet positions, creating vulnerability to exchange rate movements and foreign currency liquidity stress. This encompasses asset-liability mismatches in foreign currencies creating foreign exchange risk, concentration of foreign currency assets or liabilities relative to capital, concentration to emerging market currencies with higher volatility, foreign currency liquidity risk from inability to obtain specific currencies during stress, and structural foreign currency positions from investments in foreign subsidiaries. Assessment includes measurement of net open foreign currency positions by currency, analysis of foreign currency asset-liability maturity mismatches, stress testing of currency concentrations under exchange rate shock scenarios, evaluation of foreign currency liquidity sources and market depth, and assessment of natural hedges from correlated foreign currency assets and liabilities. Risk management encompasses limits on foreign currency exposures and concentrations, hedging strategies using foreign exchange derivatives or natural hedges, foreign currency liquidity management ensuring access to material currencies, diversification across currencies for international operations, monitoring of foreign exchange markets and currency-specific risks, and contingency planning for foreign currency liquidity stress including access to foreign exchange swap lines or currency conversion capabilities."
  },
  {
    "title": "Collateral & Security Concentration",
    "text": "Collateral concentration risk arises from over-reliance on specific types of collateral or security for credit risk mitigation, creating vulnerability if collateral values decline or enforceability is challenged. This includes concentration to real estate collateral with exposure to property market cycles, concentration to financial collateral such as securities or cash deposits, concentration to specific asset types as collateral including inventory, equipment, or receivables, concentration to guarantees from specific guarantors or types of guarantors, geographic concentration of collateral locations, and correlation between obligor creditworthiness and collateral value creating wrong-way risk. Assessment encompasses measurement of collateral concentrations by type, location, and quality, analysis of collateral valuation methodologies and revaluation frequency, stress testing of collateral values under adverse scenarios affecting specific collateral types, evaluation of legal enforceability and recovery timelines for different collateral types, and assessment of collateral correlation with obligor default probability. Risk management includes limits on collateral concentrations and loan-to-value ratios, diversification of collateral types accepted, conservative collateral valuation with appropriate haircuts, regular revaluation of collateral especially for volatile asset types, legal review of security documentation and enforceability, monitoring of collateral quality and coverage ratios, and contingency planning for collateral liquidation including market capacity and execution strategies."
  },
  {
    "title": "Concentration Risk Measurement & Metrics",
    "text": "Concentration risk measurement quantifies the degree of concentration and potential impact on capital adequacy using various metrics and methodologies. This encompasses Herfindahl-Hirschman Index (HHI) measuring concentration across exposures with higher values indicating greater concentration, calculation of exposure shares to largest counterparties or sectors, granularity analysis examining number and size distribution of exposures, concentration ratios such as top 10 or top 20 exposures relative to capital, name concentration metrics for single obligor risk, and sector concentration indices. Advanced approaches include portfolio credit risk models such as CreditMetrics or CreditRisk+ incorporating concentration effects through correlation assumptions, economic capital models allocating capital for concentration risk, stress testing and scenario analysis quantifying losses under concentrated exposure defaults, marginal risk contribution analysis identifying exposures contributing most to portfolio risk, and diversification metrics measuring risk reduction from portfolio effects. Requirements under Pillar 2 include assessment of concentration risk not fully captured in Pillar 1, quantification of additional capital needs for material concentrations, documentation of concentration risk measurement methodologies, validation of models and assumptions, and supervisory review of concentration risk management and capital adequacy."
  },
  {
    "title": "Concentration Risk Limits & Governance",
    "text": "Concentration risk governance establishes frameworks for identifying, measuring, monitoring, and controlling concentration risk through limits, policies, and oversight structures. This encompasses risk appetite statements defining acceptable concentration levels across dimensions including single name, sector, geography, and product, limit frameworks with quantitative thresholds for different concentration types, escalation procedures when limits are approached or breached, exception approval processes for limit excesses with appropriate authority levels, and periodic limit reviews ensuring continued appropriateness. Governance structure includes board oversight of concentration risk strategy and appetite, senior management responsibility for concentration risk management, risk committee review of concentration exposures and limit utilization, independent risk function monitoring and reporting, and business line accountability for managing concentrations within limits. Reporting includes regular concentration risk reports to board and senior management, monitoring of concentration metrics and trends, early warning indicators for emerging concentrations, stress testing results for concentrated exposures, and regulatory reporting of large exposures and concentrations. Risk culture encompasses awareness of concentration risk across organization, training on concentration risk identification and management, incentive structures discouraging excessive concentration, and challenge culture enabling escalation of concentration concerns."
  }
]
