[
  {
    "title": "Board of Directors & Management Body",
    "text": "The board of directors or management body bears ultimate responsibility for the institution's strategy, risk appetite, and oversight of risk management, requiring appropriate composition, expertise, and functioning. This encompasses board composition with sufficient size, diversity of skills, experience, and backgrounds, independence requirements with adequate non-executive and independent directors, collective suitability ensuring board possesses necessary competencies in banking, finance, risk management, and relevant business areas, individual suitability of board members assessed through fit and proper requirements including reputation, experience, and time commitment, separation of chair and CEO roles or appropriate checks and balances, board committees including risk committee, audit committee, remuneration committee, and nomination committee with clear mandates, board meeting frequency and attendance requirements, access to information and management, and succession planning for board positions. Responsibilities include approval of strategy and business plan, setting risk appetite and limits, oversight of risk management framework, approval of policies and key decisions, monitoring of performance and risk profile, ensuring adequate capital and liquidity, oversight of compliance and internal controls, and accountability to shareholders and supervisors. Requirements include documented board charter and committee terms of reference, minutes of board meetings, annual board self-assessment, induction and ongoing training programs, and supervisory assessment of board effectiveness."
  },
  {
    "title": "Senior Management & Executive Oversight",
    "text": "Senior management implements board-approved strategy and risk appetite, manages day-to-day operations, and ensures effective risk management and control environment. This includes CEO responsibility for overall management and execution of strategy, CFO oversight of financial management and reporting, CRO independence and authority over risk management, heads of business lines accountable for risks in their areas, heads of control functions including compliance, internal audit, and risk management, management committees such as executive committee, asset-liability committee (ALCO), and credit committee, clear reporting lines and accountability, delegation of authority framework, and succession planning for key management positions. Responsibilities encompass implementation of board decisions and strategy, development of policies and procedures, allocation of resources to business and control functions, establishment and maintenance of risk management framework, monitoring of risk profile and limit utilization, escalation of issues to board, ensuring compliance with laws and regulations, and fostering appropriate risk culture. Requirements include fit and proper assessments of senior management, documented roles and responsibilities, management committee charters and meeting minutes, performance evaluation and accountability mechanisms, and supervisory assessment of management quality and effectiveness."
  },
  {
    "title": "Risk Appetite Framework",
    "text": "Risk appetite framework (RAF) defines the types and levels of risk the institution is willing to accept in pursuit of business objectives, providing boundaries for risk-taking and guiding strategic and operational decisions. This encompasses risk appetite statement articulating overall risk tolerance approved by board, risk capacity representing maximum risk the institution can assume given capital and liquidity constraints, risk profile showing actual risk exposures, risk limits translating appetite into quantitative thresholds for specific risk types, risk metrics and key risk indicators (KRIs) for monitoring, and risk tolerances for qualitative risks. RAF covers all material risks including credit, market, liquidity, operational, concentration, interest rate, business, strategic, and reputational risks, with metrics such as capital ratios, liquidity ratios, credit quality indicators, earnings volatility, and loss limits. Implementation includes cascading of risk appetite to business lines and legal entities, integration with strategic planning and budgeting, limit setting and monitoring processes, escalation procedures for limit breaches, and periodic review and recalibration. Requirements include board approval of risk appetite, documentation of RAF methodology and governance, stress testing of risk appetite under adverse scenarios, reporting of risk profile against appetite, and supervisory assessment of RAF appropriateness and effectiveness."
  },
  {
    "title": "Three Lines of Defense Model",
    "text": "The three lines of defense model establishes clear roles and responsibilities for risk management and control, ensuring appropriate segregation and independence. First line of defense comprises business and operational management owning and managing risks in their areas, implementing controls, and ensuring compliance with policies and limits, with accountability for risk-taking decisions and day-to-day risk management. Second line of defense includes independent risk management function providing oversight, challenge, and guidance on risk matters, compliance function ensuring adherence to laws and regulations, and other control functions such as finance and legal, with responsibilities for policy development, limit setting, risk monitoring and reporting, independent assessment of first line activities, and escalation of concerns. Third line of defense consists of internal audit providing independent assurance on effectiveness of governance, risk management, and controls, with audit plan based on risk assessment, reporting to board audit committee, and independence from first and second lines. Requirements include clear definition of roles and responsibilities for each line, appropriate independence and authority for second and third lines, adequate resources and expertise in control functions, reporting lines ensuring independence with risk and audit functions reporting to board committees, coordination and information sharing between lines while maintaining independence, and avoidance of conflicts of interest or inappropriate assumption of first line responsibilities by control functions."
  },
  {
    "title": "Chief Risk Officer & Risk Function",
    "text": "The Chief Risk Officer (CRO) leads the independent risk management function, providing oversight and challenge to business activities and ensuring effective risk identification, measurement, monitoring, and mitigation. CRO independence is ensured through reporting to board risk committee or CEO with direct access to board, involvement in all material risk decisions, authority to challenge business decisions, protection from removal without board approval, and remuneration not linked to business line performance. Risk function responsibilities include development of risk management framework and policies, implementation of risk appetite and limit framework, independent assessment and validation of risk models, risk monitoring and reporting to senior management and board, oversight of risk-taking activities, stress testing and scenario analysis, emerging risk identification, and coordination of risk management across the organization. Risk function structure encompasses central risk management team and risk officers embedded in business lines with reporting to CRO, coverage of all material risk types, sufficient resources and expertise, and appropriate systems and tools. Requirements include CRO fit and proper assessment, documented risk function charter and authority, independence safeguards, adequate budget and staffing, access to information and management, and supervisory assessment of risk function effectiveness and CRO stature within organization."
  },
  {
    "title": "Internal Audit Function",
    "text": "Internal audit provides independent, objective assurance on the effectiveness of governance, risk management, and internal controls, reporting to board audit committee. This encompasses audit scope covering all activities, processes, and entities including business lines, control functions, IT systems, and outsourced activities, risk-based audit planning prioritizing areas of highest risk, audit execution including testing of controls, assessment of compliance, and evaluation of process effectiveness, audit findings and recommendations for improvement, follow-up on management actions to address findings, and coordination with external auditors and supervisors. Independence requirements include organizational independence with reporting to audit committee, objectivity of individual auditors free from conflicts of interest, no involvement in operational activities or control functions, rotation of audit staff, and protection from interference. Audit committee responsibilities include approval of audit charter and plan, oversight of audit function, review of audit findings, monitoring of management remediation, assessment of auditor independence and effectiveness, and approval of head of internal audit appointment and removal. Requirements include qualified and experienced audit staff, adequate resources and budget, access to all information and personnel, audit methodology and quality assurance, documentation of audit work, and supervisory assessment of audit function effectiveness and independence."
  },
  {
    "title": "Risk Data Aggregation & Reporting",
    "text": "Risk data aggregation and reporting capabilities enable institutions to collect, aggregate, and report risk data accurately and timely, supporting risk management and decision-making. Principles include accuracy and integrity of risk data through validation, reconciliation, and controls, completeness covering all material risk exposures and positions, timeliness enabling reporting within required timeframes including daily for trading risks and more frequent during stress, adaptability allowing generation of ad-hoc reports and stress scenarios, and comprehensiveness covering all risk types and legal entities. Data architecture encompasses data governance framework defining ownership and standards, data quality management with controls and monitoring, data lineage and reconciliation processes, data aggregation capabilities consolidating data across systems and entities, and reporting infrastructure producing management and regulatory reports. Risk reporting includes regular reports to board and senior management on risk profile, limit utilization, and key risk indicators, stress testing results, emerging risks, and material risk events, with reports tailored to audience and providing actionable information. Requirements under BCBS 239 principles include board and senior management oversight of data capabilities, data architecture and IT infrastructure supporting aggregation, accuracy and reliability controls, comprehensiveness and timeliness standards, adaptability for stress and crisis situations, and supervisory assessment of compliance with principles particularly for systemically important institutions."
  },
  {
    "title": "Risk Culture & Conduct",
    "text": "Risk culture encompasses the values, beliefs, attitudes, and behaviors relating to risk awareness and risk-taking within the organization, influencing how risks are identified, understood, discussed, and acted upon. Strong risk culture characteristics include tone from the top with board and senior management demonstrating commitment to sound risk management, accountability with clear ownership of risks and consequences for risk decisions, effective communication and challenge enabling open discussion of risks and concerns, incentives aligned with risk appetite and long-term sustainability rather than short-term profits, and competence with adequate training and expertise in risk management. Assessment of risk culture includes surveys and interviews gauging employee perceptions and behaviors, analysis of risk incidents and near-misses for cultural factors, review of decision-making processes and challenge mechanisms, evaluation of incentive structures and performance management, and observation of behaviors and tone in meetings and communications. Risk culture improvement initiatives encompass leadership commitment and role modeling, communication of risk appetite and expectations, training and awareness programs, adjustment of incentives and consequences, empowerment of control functions, and recognition of good risk management behaviors. Requirements include board oversight of risk culture, assessment of culture as part of governance reviews, integration of culture considerations in hiring and promotion, whistleblower protections encouraging reporting of concerns, and supervisory assessment of culture through on-site inspections and thematic reviews."
  },
  {
    "title": "Remuneration & Incentive Structures",
    "text": "Remuneration policies and practices must align incentives with sound risk management, long-term performance, and stakeholder interests, avoiding excessive risk-taking for short-term gains. This encompasses governance with board remuneration committee comprising non-executive directors overseeing remuneration policy and decisions, independence of remuneration decisions from business line influence, and involvement of risk and control functions in remuneration decisions. Principles include alignment with risk appetite and business strategy, balance between fixed and variable compensation with sufficient fixed component, deferral of variable compensation over multi-year periods typically 3-5 years, performance adjustment mechanisms including malus reducing unvested awards and clawback recovering paid compensation based on risk outcomes and conduct, risk adjustment of variable compensation considering risk-adjusted performance metrics, and avoidance of guaranteed bonuses except in limited circumstances. Identified staff subject to enhanced requirements include senior management, material risk-takers, and control function staff, with at least 40-60% of variable compensation deferred, at least 50% in instruments such as shares or contingent capital, and vesting subject to continued employment and performance. Requirements include documented remuneration policy approved by board and shareholders, disclosure of remuneration practices and amounts for identified staff, supervisory review of remuneration policies and practices, and assessment of alignment with risk management and culture."
  },
  {
    "title": "Internal Capital & Liquidity Adequacy Assessment (ICAAP/ILAAP)",
    "text": "Internal Capital Adequacy Assessment Process (ICAAP) and Internal Liquidity Adequacy Assessment Process (ILAAP) are institution-owned assessments of capital and liquidity adequacy relative to risk profile and business strategy. ICAAP encompasses identification of all material risks including Pillar 1 risks (credit, market, operational) and other risks such as interest rate risk in banking book, concentration risk, business risk, strategic risk, and reputational risk, quantification of capital needs for material risks using internal models, stress testing, or other methodologies, assessment of capital adequacy under current and forward-looking scenarios including stress, evaluation of capital management and planning processes, and documentation of ICAAP framework, methodologies, and results. ILAAP includes assessment of liquidity risk profile and drivers, quantification of liquidity needs under normal and stress scenarios, evaluation of funding strategy and sources, assessment of liquidity buffers and contingency funding plans, and documentation of ILAAP framework and results. Supervisory Review and Evaluation Process (SREP) assesses ICAAP and ILAAP quality, evaluating risk identification and assessment, methodologies and assumptions, stress testing, governance and controls, and integration with management processes, resulting in Pillar 2 requirements (P2R) as binding capital and liquidity add-ons and Pillar 2 guidance (P2G) as supervisory expectations. Requirements include proportionate ICAAP/ILAAP appropriate to size and complexity, annual update and submission to supervisors, board and senior management ownership, independent validation, integration with risk management and business planning, and documentation of frameworks, methodologies, assumptions, and governance."
  }
]
