[
  {
    "title": "ICT Risk Management Framework",
    "text": "ICT risk management framework under Digital Operational Resilience Act (DORA) establishes comprehensive governance, policies, and processes for managing information and communication technology risks. This encompasses ICT risk management strategy approved by management body defining risk appetite and objectives, ICT risk governance with clear roles and responsibilities including board oversight and senior management accountability, identification and classification of ICT assets and systems based on criticality and sensitivity, ICT risk assessment processes evaluating threats, vulnerabilities, and potential impacts, risk treatment decisions including acceptance, mitigation, transfer, or avoidance, and continuous monitoring of ICT risk profile. Framework covers all ICT systems including core banking systems, payment systems, trading platforms, customer-facing applications, data storage and processing, networks and telecommunications, and third-party ICT services. Requirements include documented ICT risk management framework proportionate to size and complexity, integration with overall risk management framework, regular review and updates of ICT risk assessments, reporting to management body on ICT risks and incidents, allocation of sufficient resources and budget for ICT risk management, and supervisory assessment of framework adequacy and effectiveness."
  },
  {
    "title": "Cybersecurity Threats & Attack Vectors",
    "text": "Cybersecurity threats encompass malicious activities targeting confidentiality, integrity, or availability of information systems and data. This includes malware such as viruses, worms, trojans, and spyware designed to damage systems or steal data, ransomware encrypting data and demanding payment for decryption, phishing attacks using fraudulent emails or websites to steal credentials or information, distributed denial-of-service (DDoS) attacks overwhelming systems to disrupt availability, advanced persistent threats (APT) involving sophisticated, prolonged attacks by organized groups or nation-states, SQL injection and other application vulnerabilities exploiting software weaknesses, man-in-the-middle attacks intercepting communications, credential theft and account compromise, insider threats from malicious or negligent employees, supply chain attacks compromising third-party software or services, and zero-day exploits targeting previously unknown vulnerabilities. Attack vectors include email as primary delivery mechanism for phishing and malware, web applications with vulnerabilities, removable media and USB devices, remote access and VPN connections, mobile devices and applications, social engineering manipulating human behavior, and physical access to facilities or equipment. Defense requires layered security controls, threat intelligence monitoring emerging threats, security awareness training, incident detection and response capabilities, and regular security assessments and penetration testing."
  },
  {
    "title": "Data Protection & Privacy (GDPR)",
    "text": "Data protection and privacy requirements under General Data Protection Regulation (GDPR) and similar laws govern collection, processing, storage, and transfer of personal data. This encompasses lawful basis for processing requiring consent, contractual necessity, legal obligation, vital interests, public task, or legitimate interests, data minimization collecting only necessary data, purpose limitation using data only for specified purposes, accuracy ensuring data is correct and up-to-date, storage limitation retaining data only as long as necessary, and integrity and confidentiality protecting data through appropriate security. Rights of data subjects include right to access their data, right to rectification of inaccurate data, right to erasure (right to be forgotten), right to restriction of processing, right to data portability, right to object to processing, and rights related to automated decision-making and profiling. Requirements include data protection impact assessments (DPIA) for high-risk processing, appointment of data protection officer (DPO) for certain organizations, records of processing activities, privacy by design and by default, data breach notification to supervisory authority within 72 hours and to affected individuals when high risk, international data transfer mechanisms such as adequacy decisions, standard contractual clauses, or binding corporate rules, and accountability demonstrating compliance through policies, procedures, and documentation. Penalties for non-compliance can reach up to 4% of annual global turnover or €20 million."
  },
  {
    "title": "Incident Detection & Response",
    "text": "Incident detection and response capabilities enable timely identification, containment, and recovery from cybersecurity incidents and ICT disruptions. Detection mechanisms include security information and event management (SIEM) systems aggregating and analyzing logs from multiple sources, intrusion detection and prevention systems (IDS/IPS) monitoring network traffic for malicious activity, endpoint detection and response (EDR) monitoring devices for threats, user and entity behavior analytics (UEBA) identifying anomalous behaviors, threat intelligence feeds providing indicators of compromise, security operations center (SOC) with 24/7 monitoring, and automated alerting on suspicious activities. Incident response process encompasses preparation with documented incident response plan, roles and responsibilities, and communication procedures, detection and analysis classifying incidents by severity and impact, containment isolating affected systems to prevent spread, eradication removing threat and closing vulnerabilities, recovery restoring systems and data to normal operations, and post-incident review identifying lessons learned and improvements. Requirements under DORA include classification of ICT-related incidents based on criticality and impact, reporting of major incidents to supervisory authorities within specified timeframes (initial notification, intermediate reports, final report), root cause analysis, maintenance of incident register, testing of incident response procedures, and supervisory assessment of detection and response capabilities."
  },
  {
    "title": "Third-Party ICT Service Providers",
    "text": "Third-party ICT service provider risk arises from outsourcing or procurement of ICT services including cloud computing, data centers, software development, IT support, and payment processing. This encompasses concentration risk from critical service providers, vendor financial stability and business continuity, data security and confidentiality at vendor sites, compliance with regulations by vendors, subcontracting and fourth-party risk, vendor lock-in and exit challenges, and cross-border services with jurisdictional issues. Due diligence before engagement includes assessment of vendor capabilities, security controls, certifications (ISO 27001, SOC 2), financial strength, references, and contractual protections. Contractual requirements include service level agreements (SLAs) defining performance standards, security and data protection obligations, audit and inspection rights, incident notification requirements, business continuity and disaster recovery commitments, data ownership and portability, termination and exit assistance, liability and indemnification, and regulatory compliance including right for supervisors to access information and conduct inspections. Ongoing oversight includes monitoring of vendor performance against SLAs, regular security assessments and audits, review of vendor security incidents and breaches, testing of vendor business continuity capabilities, and vendor risk reviews. Requirements under DORA include register of third-party ICT service providers, risk assessment of critical providers, contractual arrangements meeting regulatory standards, exit strategies, and enhanced oversight of critical third-party providers by supervisors."
  },
  {
    "title": "Digital Operational Resilience Testing",
    "text": "Digital operational resilience testing under DORA ensures ICT systems and processes can withstand, respond to, and recover from ICT-related disruptions. Testing types include vulnerability assessments identifying weaknesses in systems and applications, open source and proprietary vulnerability scanning, penetration testing simulating attacks to exploit vulnerabilities, scenario-based testing evaluating response to specific incident scenarios, business continuity and disaster recovery testing validating recovery capabilities, and threat-led penetration testing (TLPT) simulating sophisticated attacks by skilled threat actors mimicking real-world adversaries. TLPT framework includes scoping identifying critical functions and systems to test, threat intelligence gathering information on relevant threat actors and tactics, red team testing with ethical hackers conducting attacks, blue team defense by institution's security teams, controls testing evaluating detection and response, and closure phase with reporting and remediation. Testing frequency depends on risk profile with annual testing for most institutions and more frequent testing for critical systems, with TLPT required at least every three years for major financial institutions. Requirements include documented testing strategy and plan, independence of testers from tested systems, remediation of identified vulnerabilities within defined timeframes, reporting of testing results to management body, documentation of tests and findings, and supervisory oversight of testing programs particularly TLPT for systemically important institutions."
  },
  {
    "title": "Access Control & Identity Management",
    "text": "Access control and identity management ensure only authorized individuals can access systems, data, and facilities based on legitimate business needs. This encompasses user identification and authentication verifying identity through credentials, multi-factor authentication (MFA) requiring multiple verification methods such as password plus token or biometric, single sign-on (SSO) enabling access to multiple systems with one authentication, privileged access management (PAM) controlling and monitoring administrative accounts with elevated privileges, role-based access control (RBAC) granting permissions based on job roles, least privilege principle providing minimum necessary access, segregation of duties preventing single individuals from controlling critical processes, access reviews periodically verifying appropriateness of access rights, and timely deprovisioning removing access when no longer needed such as employee termination or role change. Identity lifecycle management includes provisioning new users with appropriate access, modifications when roles change, and deprovisioning when leaving organization or changing roles. Technical controls include strong password policies with complexity, length, and expiration requirements, account lockout after failed login attempts, session timeouts, encryption of credentials, monitoring of access attempts and privileged activities, and logging of access for audit trails. Requirements include documented access control policies, regular access reviews and recertification, monitoring and alerting on suspicious access patterns, audit trails of access and changes, and assessment of access control effectiveness through audits and testing."
  },
  {
    "title": "Encryption & Cryptography",
    "text": "Encryption and cryptographic controls protect confidentiality and integrity of data in transit and at rest, preventing unauthorized access or tampering. This encompasses encryption of data at rest including databases, file systems, backups, and archives using strong algorithms such as AES-256, encryption of data in transit using TLS/SSL for network communications and secure protocols for file transfers, end-to-end encryption for sensitive communications, encryption of mobile devices and removable media, and tokenization or masking of sensitive data such as payment card numbers. Cryptographic key management includes key generation using secure random number generators, key storage in hardware security modules (HSM) or key management systems, key rotation and lifecycle management, key backup and recovery procedures, and key destruction when no longer needed. Certificate management for public key infrastructure (PKI) includes issuance of digital certificates, certificate validation and revocation checking, certificate renewal before expiration, and trust store management. Requirements include cryptographic standards and algorithms approved by authorities such as NIST or ENISA, key management policies and procedures, separation of duties for key management, regular review and update of cryptographic controls as algorithms become obsolete, and assessment of encryption implementation and key management practices."
  },
  {
    "title": "Network Security & Segmentation",
    "text": "Network security protects network infrastructure and communications from unauthorized access, attacks, and disruptions through defense-in-depth approach. This encompasses network segmentation dividing network into zones based on security requirements and trust levels, firewalls controlling traffic between network segments based on rules, intrusion detection and prevention systems (IDS/IPS) monitoring and blocking malicious traffic, virtual private networks (VPN) for secure remote access, network access control (NAC) enforcing security policies before allowing device connections, demilitarized zones (DMZ) isolating public-facing systems from internal networks, wireless network security with encryption and authentication, and distributed denial-of-service (DDoS) protection. Network architecture principles include defense in depth with multiple layers of security, zero trust model verifying every access request regardless of location, micro-segmentation limiting lateral movement within networks, and separation of production, development, and test environments. Monitoring and management includes network traffic analysis identifying anomalies, security information and event management (SIEM) correlating network events, vulnerability scanning of network devices, configuration management ensuring secure settings, patch management for network equipment, and change control for network modifications. Requirements include documented network architecture and security zones, regular network security assessments and penetration testing, monitoring of network traffic and security events, incident response for network attacks, and review of network security controls."
  },
  {
    "title": "Business Continuity & Disaster Recovery for ICT",
    "text": "Business continuity and disaster recovery for ICT ensure critical systems and data can be recovered and operations resumed following disruptions including cyber attacks, system failures, natural disasters, or other incidents. This encompasses business impact analysis (BIA) identifying critical systems and acceptable downtime, recovery time objectives (RTO) defining maximum acceptable downtime for each system, recovery point objectives (RPO) defining maximum acceptable data loss, backup strategies including full, incremental, and differential backups with appropriate frequency, backup storage with offsite or cloud-based copies protected from primary site disasters, backup testing and restoration drills verifying recoverability, disaster recovery sites including hot sites with real-time replication, warm sites with periodic updates, or cold sites requiring setup time, failover and failback procedures for switching to recovery site and returning to primary site, and data replication technologies for continuous data protection. Testing requirements include annual testing of disaster recovery plans, scenario-based testing simulating various disruption types, involvement of business users in testing, documentation of test results and issues, and remediation of identified gaps. Requirements include documented business continuity and disaster recovery plans for ICT, alignment of RTO/RPO with business requirements, regular backups with secure storage, testing of recovery capabilities, incident response integration, and supervisory assessment of resilience and recovery capabilities particularly for critical systems."
  }
]
