[
  {
    "title": "Physical Climate Risks",
    "text": "Physical climate risks arise from climate-related events and long-term shifts in climate patterns affecting assets, operations, and counterparties. Acute physical risks include extreme weather events such as hurricanes, floods, wildfires, heatwaves, droughts, and storms with increasing frequency and severity, causing direct damage to properties, infrastructure, and collateral, business interruptions, and supply chain disruptions. Chronic physical risks involve gradual changes including rising temperatures, sea level rise, changing precipitation patterns, ocean acidification, and biodiversity loss, affecting asset values, agricultural productivity, water availability, and habitability of regions. Impact channels include credit risk from borrower defaults when physical events damage income-generating assets or collateral, market risk from repricing of assets in affected regions, operational risk from damage to bank facilities and infrastructure, and liquidity risk from sudden large claims or deposit withdrawals. Assessment requires identification of exposures to physical risk including geographic location of borrowers, collateral, and operations, climate hazard mapping using climate models and scenarios, vulnerability assessment of assets and counterparties, and quantification of potential financial impacts. Risk management includes integration of physical risk in credit underwriting and collateral valuation, geographic diversification, insurance requirements for high-risk properties, engagement with clients on adaptation measures, and stress testing of physical risk scenarios."
  },
  {
    "title": "Transition Risks",
    "text": "Transition risks arise from the shift toward a low-carbon economy through policy changes, technological developments, market dynamics, and reputational factors, potentially affecting asset values and business models. Policy and legal risks include carbon pricing mechanisms such as carbon taxes or emissions trading systems increasing costs for carbon-intensive activities, regulatory requirements for emissions reductions or energy efficiency, phase-out of fossil fuel subsidies, restrictions on high-emission activities, and litigation against companies for climate-related damages or disclosure failures. Technology risks involve development of clean technologies making existing technologies obsolete, stranded assets from fossil fuel reserves or carbon-intensive infrastructure becoming uneconomic, disruption of traditional business models, and investment needs for transition. Market risks include changing consumer preferences toward sustainable products, investor pressure for decarbonization, repricing of carbon-intensive assets, and shifts in supply and demand for commodities. Reputational risks arise from association with high-emission activities, failure to address climate change, or perceived greenwashing. Impact channels include credit risk from borrowers in transition-exposed sectors facing declining revenues or stranded assets, market risk from repricing of carbon-intensive securities, and strategic risk from business model disruption. Assessment requires identification of exposures to transition-sensitive sectors including fossil fuels, utilities, transportation, heavy industry, and agriculture, scenario analysis using transition pathways such as orderly, disorderly, or hot house world scenarios, and quantification of financial impacts under different transition speeds and policy approaches."
  },
  {
    "title": "Climate-Related Financial Disclosures (TCFD)",
    "text": "Task Force on Climate-related Financial Disclosures (TCFD) framework provides recommendations for consistent, comparable, and decision-useful climate-related financial disclosures. Four pillars include governance describing board oversight of climate risks and management's role in assessing and managing climate risks, strategy disclosing actual and potential impacts of climate risks and opportunities on business, strategy, and financial planning including resilience under different climate scenarios, risk management describing processes for identifying, assessing, and managing climate risks and integration with overall risk management, and metrics and targets disclosing metrics used to assess climate risks and opportunities and targets for managing climate risks and achieving opportunities. Governance disclosures include board committee responsibilities, management committees and roles, frequency of board and management discussions on climate, and integration in remuneration. Strategy disclosures include short, medium, and long-term climate risks and opportunities, impact on business lines, products, and services, scenario analysis assessing resilience under 2°C or lower, higher temperature, and other scenarios, and strategic responses and transition planning. Risk management disclosures include processes for identifying and assessing climate risks, prioritization and materiality assessment, integration with enterprise risk management, and monitoring and reporting. Metrics and targets include greenhouse gas emissions (Scope 1, 2, and 3), climate-related risks in lending and investment portfolios, green asset ratios, and targets for emissions reduction, green finance, or portfolio alignment. Requirements include annual disclosure in financial filings, assurance of climate disclosures, and supervisory assessment of disclosure quality and completeness."
  },
  {
    "title": "EU Taxonomy & Sustainable Finance",
    "text": "EU Taxonomy for sustainable activities provides classification system defining environmentally sustainable economic activities based on technical screening criteria. Six environmental objectives include climate change mitigation, climate change adaptation, sustainable use and protection of water and marine resources, transition to circular economy, pollution prevention and control, and protection and restoration of biodiversity and ecosystems. Activity qualifies as sustainable if it makes substantial contribution to at least one objective, does no significant harm (DNSH) to other objectives, meets minimum social safeguards, and complies with technical screening criteria. Technical screening criteria specify thresholds and requirements for activities such as emissions intensity for power generation, energy efficiency for buildings, or sustainable forest management practices. Disclosure requirements under Taxonomy Regulation include proportion of taxonomy-eligible and taxonomy-aligned activities in total assets, turnover, and capital expenditure for non-financial companies, and green asset ratio (GAR) for banks showing proportion of taxonomy-aligned exposures in covered assets. Covered assets include exposures to non-financial corporations, loans for real estate, and certain other exposures, with exclusions for sovereign exposures, central banks, and some other categories. Requirements include data collection from counterparties on taxonomy alignment, assessment of substantial contribution and DNSH criteria, calculation and disclosure of GAR and other taxonomy metrics, and supervisory monitoring of taxonomy implementation and disclosure quality. Challenges include data availability from counterparties, interpretation of technical criteria, and assessment of DNSH and minimum safeguards."
  },
  {
    "title": "Climate Stress Testing & Scenario Analysis",
    "text": "Climate stress testing and scenario analysis assess financial resilience under different climate pathways and transition speeds over long time horizons. Scenarios include orderly transition with early, ambitious policy action enabling smooth transition to net zero by 2050, disorderly transition with late or sudden policy action causing abrupt repricing and disruption, hot house world with limited policy action leading to severe physical risks from temperature increases of 3°C or more, and current policies scenario continuing existing policies without additional action. Time horizons extend to 2050 or beyond reflecting long-term nature of climate risks, with projections of macroeconomic variables, carbon prices, energy prices, sectoral impacts, and physical damages. Transmission channels include credit risk from defaults and rating migrations in affected sectors, market risk from repricing of assets, operational risk from physical damage to facilities, and income effects from changing business volumes and margins. Methodology includes top-down approaches using macroeconomic models to project portfolio impacts, bottom-up approaches assessing individual exposures or counterparties, and hybrid approaches combining both. Supervisory climate stress tests such as ECB climate stress test assess banking sector resilience, identify vulnerabilities, and inform supervisory dialogue, with results used for risk management improvements rather than capital requirements. Requirements include participation in supervisory stress tests, internal climate stress testing integrated with ICAAP, scenario analysis for strategy and disclosure, documentation of methodologies and assumptions, and use of results for risk management, capital planning, and business strategy."
  },
  {
    "title": "Green Asset Ratio & Portfolio Alignment",
    "text": "Green asset ratio (GAR) measures proportion of bank assets financing taxonomy-aligned environmentally sustainable activities, providing metric for transition progress and comparison across institutions. GAR calculation includes numerator of taxonomy-aligned exposures meeting technical screening criteria for substantial contribution, DNSH, and minimum safeguards, and denominator of covered assets including loans to non-financial corporations, real estate loans, and certain other exposures, excluding sovereign exposures, exposures to financial institutions, and trading book. Disclosure includes GAR for total assets and separate ratios for different asset classes, proportion of taxonomy-eligible but not yet aligned exposures, and proportion of non-eligible exposures. Portfolio alignment metrics assess consistency of lending and investment portfolios with climate goals such as Paris Agreement temperature targets, using methodologies such as implied temperature rise (ITR) showing temperature outcome if all economic activity followed portfolio's emissions intensity, portfolio carbon footprint measuring financed emissions, or sector-based alignment comparing portfolio composition to transition pathways. Alignment assessment requires emissions data from counterparties, forward-looking transition plans, and comparison to sector decarbonization pathways. Requirements include annual disclosure of GAR and components, explanation of changes over time, targets for increasing GAR or portfolio alignment, and integration in business strategy and risk appetite. Challenges include data quality and availability from counterparties, evolving taxonomy criteria, and methodological choices for alignment metrics."
  },
  {
    "title": "Carbon-Intensive Sector Exposures",
    "text": "Carbon-intensive sector exposures create concentration risk and transition vulnerability requiring enhanced monitoring and management. High-emission sectors include fossil fuel extraction (coal, oil, gas), fossil fuel power generation, energy-intensive industries (steel, cement, chemicals), transportation (aviation, shipping, road transport), and agriculture. Assessment includes identification and measurement of exposures to carbon-intensive sectors, analysis of emissions intensity and transition readiness of counterparties, evaluation of business model sustainability under transition scenarios, and assessment of stranded asset risk from reserves or infrastructure becoming uneconomic. Transition readiness indicators include emissions reduction targets and progress, capital expenditure on low-carbon technologies, revenue from sustainable activities, climate governance and strategy, and alignment with sector transition pathways. Risk management includes sector limits and risk appetite for carbon-intensive exposures, enhanced due diligence and monitoring, engagement with clients on transition planning, support for transition through green finance and advisory services, and portfolio rebalancing toward sustainable activities. Supervisory expectations include identification of material carbon-intensive exposures, assessment of transition risks, stress testing of concentrated exposures, integration in credit risk management and capital planning, and disclosure of sector exposures and management approach. Challenges include defining sector boundaries, assessing transition readiness with limited data, balancing transition support with risk management, and managing reputational risks from continued financing of high-emission activities."
  },
  {
    "title": "Stranded Assets & Fossil Fuel Exposure",
    "text": "Stranded assets are assets that suffer unanticipated or premature write-downs, devaluations, or conversion to liabilities due to transition to low-carbon economy. Fossil fuel stranded assets include coal, oil, and gas reserves becoming uneconomic to extract due to carbon pricing, regulation, or demand reduction, fossil fuel power plants retired early or operating at reduced capacity, and fossil fuel infrastructure such as pipelines or refineries becoming obsolete. Other stranded assets include carbon-intensive industrial facilities, internal combustion engine vehicle manufacturing, and real estate in climate-vulnerable locations. Drivers of stranding include policy measures such as carbon pricing or phase-out mandates, technology developments making clean alternatives cheaper, market shifts in investor and consumer preferences, physical climate impacts affecting asset viability, and reputational factors. Financial impacts include credit losses from borrower defaults or collateral value declines, market losses from asset repricing, and write-downs of equity investments. Assessment requires identification of exposures to stranding-vulnerable assets, evaluation of stranding probability and timing under different scenarios, quantification of potential losses, and assessment of borrower capacity to absorb losses or transition. Risk management includes limits on fossil fuel exposures, enhanced due diligence for stranding-vulnerable assets, conservative collateral valuation incorporating transition risks, engagement with clients on transition planning, and portfolio diversification. Requirements include disclosure of fossil fuel exposures, stress testing of stranded asset scenarios, integration in credit risk models and capital planning, and supervisory assessment of stranded asset risk management."
  },
  {
    "title": "Environmental & Social Due Diligence",
    "text": "Environmental and social (E&S) due diligence in lending and investment decisions assesses environmental impacts, climate risks, and social factors affecting credit quality and reputation. Environmental due diligence includes assessment of environmental risks such as pollution, waste management, resource use, and biodiversity impacts, compliance with environmental regulations and permits, environmental liabilities from contamination or remediation obligations, climate risks including physical and transition risks, and environmental management systems and performance. Social due diligence covers labor practices and working conditions, health and safety, community impacts and stakeholder engagement, human rights including indigenous rights, and social license to operate. Due diligence process includes screening for E&S risks based on sector, activity, and location, categorization by risk level with enhanced due diligence for high-risk transactions, assessment of E&S risks and impacts, evaluation of client E&S management capacity, and identification of mitigation measures and covenants. Requirements include E&S policies and standards defining expectations, integration of E&S assessment in credit approval process, training of credit officers on E&S risks, monitoring of E&S performance and covenant compliance, and escalation of significant E&S issues. Exclusion lists prohibit financing of certain activities such as illegal logging, production of certain weapons, or activities in protected areas. Requirements include documented E&S risk management framework, disclosure of E&S policies and exclusions, reporting on E&S risk profile and incidents, and supervisory assessment of E&S risk management practices."
  },
  {
    "title": "Climate Risk Integration in Risk Management",
    "text": "Climate risk integration embeds climate considerations across risk management framework including risk identification, assessment, monitoring, mitigation, and reporting. Credit risk integration includes incorporation of climate risks in credit underwriting and approval, adjustment of credit ratings or probability of default for climate-exposed borrowers, climate-sensitive collateral valuation, sector limits for carbon-intensive exposures, and climate stress testing of credit portfolios. Market risk integration includes assessment of climate-related market risks in trading and investment portfolios, scenario analysis of transition repricing, and climate considerations in asset allocation. Operational risk integration includes assessment of physical risks to bank facilities and operations, business continuity planning for climate events, and third-party risk management for climate-exposed suppliers. Liquidity and funding risk integration includes assessment of climate impacts on funding sources and market access, and contingency planning for climate-related liquidity stress. Capital planning integration includes assessment of climate risks in ICAAP, climate stress testing informing capital adequacy, and potential Pillar 2 capital add-ons for material climate risks. Risk appetite integration includes climate risk metrics and limits, board-approved climate risk appetite, and monitoring of climate risk profile against appetite. Governance integration includes board and senior management oversight of climate risks, climate expertise in risk function, and climate risk reporting. Requirements include comprehensive climate risk management framework, integration across all material risk types, documentation of methodologies and processes, regular review and updates, and supervisory assessment of integration quality and effectiveness."
  }
]
