[
  {
    "title": "Credit Risk",
    "text": "Credit risk encompasses the potential for financial loss arising from a borrower's failure to meet contractual obligations, counterparty default, credit quality deterioration, or downgrade events. This includes assessment of creditworthiness, probability of default (PD), loss given default (LGD), exposure at default (EAD), expected credit losses under IFRS 9, credit risk mitigation techniques including collateral and guarantees, credit concentration to individual borrowers or groups of connected clients, impairment and provisioning requirements, non-performing loans (NPL) management, forbearance measures, restructuring of exposures, securitization credit risk, and counterparty credit risk arising from derivatives, securities financing transactions, and off-balance sheet exposures."
  },
  {
    "title": "Market Risk",
    "text": "Market risk represents the potential for losses due to adverse movements in market prices including interest rate fluctuations, foreign exchange rate volatility, equity price changes, commodity price movements, and credit spread variations. This encompasses trading book positions, fair value measurement requirements, value-at-risk (VaR) methodologies, stressed VaR calculations, internal models approach versus standardized approach for market risk capital, incremental risk charge (IRC), correlation trading activities, distinction between banking book and trading book, hedging strategies and hedge accounting, derivatives valuation, market liquidity risk during stressed conditions, and wrong-way risk where exposure and counterparty credit quality are adversely correlated."
  },
  {
    "title": "Liquidity & Funding Risk",
    "text": "Liquidity and funding risk involves the inability to meet payment obligations when due without incurring unacceptable losses, or the inability to fund assets at a reasonable cost. This includes liquidity coverage ratio (LCR) requirements ensuring sufficient high-quality liquid assets to survive acute stress, net stable funding ratio (NSFR) promoting stable funding structures, intraday liquidity management, contingency funding plans and stress testing, maturity transformation risks, funding concentration from single sources or markets, encumbrance of assets affecting liquidity position, collateral management and margin requirements, access to central bank facilities, deposit stability analysis, wholesale funding dependencies, and contractual versus behavioral maturity mismatches between assets and liabilities."
  },
  {
    "title": "Operational Risk",
    "text": "Operational risk is the risk of loss resulting from inadequate or failed internal processes, human errors, system failures, or external events including natural disasters. This covers business continuity planning and disaster recovery, fraud prevention including internal fraud and external fraud, employment practices and workplace safety, damage to physical assets, business disruption and system failures, execution errors and process breakdowns, transaction processing failures, product flaws and fiduciary breaches, outsourcing risk from third-party service providers, legal risk from litigation and regulatory penalties, conduct risk from employee behavior, key person risk and succession planning, and operational resilience ensuring critical services remain within tolerance during disruption."
  },
  {
    "title": "Capital Adequacy & Solvency",
    "text": "Capital adequacy and solvency risk relates to maintaining sufficient capital resources to absorb unexpected losses and meet minimum regulatory requirements. This encompasses common equity tier 1 (CET1) capital as the highest quality loss-absorbing capital, additional tier 1 (AT1) capital instruments, tier 2 capital including subordinated debt, capital conservation buffer requiring institutions to build up capital in good times, countercyclical capital buffer varying with credit cycle, systemic risk buffers for systemically important institutions, leverage ratio as non-risk-based backstop measure, minimum requirement for own funds and eligible liabilities (MREL) for resolution planning, total loss-absorbing capacity (TLAC) for global systemically important banks, capital planning and stress testing, dividend restrictions when buffers are breached, and internal capital adequacy assessment process (ICAAP) under Pillar 2."
  },
  {
    "title": "Concentration Risk",
    "text": "Concentration risk arises from large exposures to individual counterparties, groups of connected clients, economic sectors, geographic regions, or specific instruments that could result in significant losses if exposures materialize simultaneously. This includes large exposure limits typically set at 25% of eligible capital to single counterparties, concentration to specific industries or sectors such as real estate or commodities, geographic concentration creating country risk or regional economic dependency, intra-financial system exposures between banks and other financial institutions, asset class concentration in particular types of lending or securities, funding concentration from limited number of depositors or creditors, foreign currency concentration exposures, and granularity analysis measuring portfolio diversification across the exposure base."
  },
  {
    "title": "Governance, Risk Management & Internal Controls",
    "text": "Governance and risk management encompasses the organizational framework, oversight structures, risk culture, and control systems ensuring effective identification, measurement, monitoring and mitigation of risks. This includes board of directors responsibilities and composition requirements, management body duties and fit and proper assessments, risk appetite framework defining risk tolerance levels, three lines of defense model separating risk-taking, risk control, and independent assurance functions, risk committee establishment and responsibilities, chief risk officer independence and authority, internal audit scope and reporting lines, remuneration policies aligning incentives with risk management, conflicts of interest identification and management, risk data aggregation and reporting capabilities, escalation procedures for risk limit breaches, risk culture assessment and improvement, and internal capital and liquidity adequacy assessment processes (ICAAP and ILAAP)."
  },
  {
    "title": "Technology, Cybersecurity & Information Security",
    "text": "Technology and cybersecurity risk involves threats from information and communication technology (ICT) system failures, cyber attacks including malware and ransomware, data breaches compromising personal or confidential information, and inadequate digital operational resilience. This encompasses ICT risk management frameworks under Digital Operational Resilience Act (DORA), incident detection and response procedures, cyber threat intelligence and monitoring, third-party ICT service provider oversight particularly cloud computing services, digital operational resilience testing including threat-led penetration testing, business continuity and disaster recovery for ICT systems, data protection and privacy requirements under GDPR, encryption and access control mechanisms, authentication and identity management, vulnerability management and patch management, network security and segmentation, endpoint protection, and incident reporting obligations to supervisory authorities within specified timeframes."
  },
  {
    "title": "Climate & Environmental Risk",
    "text": "Climate and environmental risk encompasses both physical risks from climate-related events such as floods, droughts, wildfires and extreme weather, and transition risks from the shift toward a low-carbon economy including policy changes, technological disruption, market sentiment shifts, and reputational damage. This includes climate-related financial disclosures under Task Force on Climate-related Financial Disclosures (TCFD), EU Taxonomy for sustainable activities classification, Sustainable Finance Disclosure Regulation (SFDR) requiring ESG integration, climate stress testing and scenario analysis assessing portfolio resilience, green asset ratio and banking book taxonomy alignment, carbon-intensive sector exposure monitoring, stranded asset risk from fossil fuel investments, environmental and social due diligence in lending decisions, physical risk assessment of collateral locations, transition planning supporting clients in decarbonization, and incorporation of climate risk into credit risk models, capital planning and risk appetite frameworks."
  },
  {
    "title": "Conduct, Consumer Protection & Market Integrity",
    "text": "Conduct and consumer protection risk involves unfair treatment of customers, mis-selling of financial products, market abuse, manipulation, insider trading, conflicts of interest, and failures in market integrity. This includes suitability and appropriateness assessments under MiFID II ensuring products match client needs and knowledge, product governance and oversight ensuring fair design and distribution, target market identification and monitoring, disclosure requirements providing clear information on costs, risks and features, treating vulnerable customers fairly including those in financial difficulty, complaint handling procedures and redress mechanisms, inducement and commission rules preventing conflicts of interest, best execution obligations ensuring optimal client outcomes, market manipulation prevention including surveillance systems, insider dealing prohibitions and insider lists, transaction reporting to regulators, recording of communications, sales process documentation, affordability assessments in consumer lending, responsible lending principles, and early arrears management to prevent consumer detriment."
  }
]
